[
    {
        "id": "Aatrox",
        "name": "Aatrox",
        "region": "Runeterra",
        "role": "Fighter",
        "title": "the Darkin Blade",
        "voice": "I must destroy even hope…",
        "story": "Once honored defenders of Shurima against the Void, Aatrox and his brethren would eventually become an even greater threat to Runeterra, and were defeated only by cunning mortal sorcery. But after centuries of imprisonment, Aatrox was the first to find freedom once more, corrupting and transforming those foolish enough to try and wield the magical weapon that contained his essence. Now, with stolen flesh, he walks Runeterra in a brutal approximation of his previous form, seeking an apocalyptic and long overdue vengeance.",
        "splash_art": "https://raw.githubusercontent.com/VietHung0712/AssetsLOL/refs/heads/main/Splash_Art/A/Aatrox/Aatrox_0.jpg",
        "animated_splash_art": "https://cmsassets.rgpub.io/sanity/files/dsfx7636/universe/606a1890faae447a7ea465d62b1dc87ab6ab360d.webm",
        "position_x": 71,
        "position_y": 28,
        "release_date": "2013-06-13",
        "updated_date": "2018-05-29"
    },
    {
        "id": "Ahri",
        "name": "Ahri",
        "region": "Ionia",
        "role": "Mage",
        "title": "The Nine-Tailed Fox",
        "voice": "Human emotions can be more volatile than even the deepest magic.",
        "story": "Innately connected to the magic of the spirit realm, Ahri is a fox-like vastaya who can manipulate her prey's emotions and consume their essence—receiving flashes of their memory and insight from each soul she consumes. Once a powerful yet wayward predator, Ahri is now traveling the world in search of remnants of her ancestors while also trying to replace her stolen memories with ones of her own making.",
        "splash_art": "https://raw.githubusercontent.com/VietHung0712/AssetsLOL/refs/heads/main/Splash_Art/A/Ahri/Ahri_0.jpg",
        "animated_splash_art": "",
        "position_x": 61,
        "position_y": 11,
        "release_date": "2011-12-14",
        "updated_date": "2023-01-25"
    },
    {
        "id": "Akali",
        "name": "Akali",
        "region": "Ionia",
        "role": "Assassin",
        "title": "the Rogue Assassin",
        "voice": "If you look dangerous, you better be dangerous.",
        "story": " Abandoning the Kinkou Order and her title of the Fist of Shadow, Akali now strikes alone, ready to be the deadly weapon her people need. Though she holds onto all she learned from her master Shen, she has pledged to defend Ionia from its enemies, one kill at a time. Akali may strike in silence, but her message will be heard loud and clear: fear the assassin with no master.",
        "splash_art": "https://raw.githubusercontent.com/VietHung0712/AssetsLOL/refs/heads/main/Splash_Art/A/Akali/Akali_0.jpg",
        "animated_splash_art": "",
        "position_x": 50,
        "position_y": 8,
        "release_date": "2010-05-11",
        "updated_date": "2018-08-01"
    },
    {
        "id": "Akshan",
        "name": "Akshan",
        "region": "Shurima",
        "role": "Marksman",
        "title": "the Rogue Sentinel",
        "voice": "Not everything happens for a reason. Some things need to be sorted out.",
        "story": "Raising an eyebrow in the face of danger, Akshan fights evil with dashing charisma, righteous vengeance, and a conspicuous lack of shirts. He is highly skilled in the art of stealth combat, able to evade the eyes of his enemies and reappear when they least expect him. With a keen sense of justice and a legendary death-reversing weapon, he rights the wrongs of Runeterra’s many scoundrels while living by his own moral code: “Don’t be an ass.",
        "splash_art": "https://raw.githubusercontent.com/VietHung0712/AssetsLOL/refs/heads/main/Splash_Art/A/Akshan/Akshan_0.jpg",
        "animated_splash_art": "",
        "position_x": 68,
        "position_y": 51,
        "release_date": "2021-07-22",
        "updated_date": null
    },
    {
        "id": "Alistar",
        "name": "Alistar",
        "region": "Runeterra",
        "role": "Tank",
        "title": "the Minotaur",
        "voice": "Nothing can hold me back!",
        "story": "Always a mighty warrior with a fearsome reputation, Alistar seeks revenge for the death of his clan at the hands of the Noxian empire. Though he was enslaved and forced into the life of a gladiator, his unbreakable will was what kept him from truly becoming a beast. Now, free of the chains of his former masters, he fights in the name of the downtrodden and the disadvantaged, his rage as much a weapon as his horns, hooves and fists.",
        "splash_art": "https://raw.githubusercontent.com/VietHung0712/AssetsLOL/refs/heads/main/Splash_Art/A/Alistar/Alistar_0.jpg",
        "animated_splash_art": "",
        "position_x": 65,
        "position_y": 30,
        "release_date": "2009-02-21",
        "updated_date": null
    },
    {
        "id": "Ambessa",
        "name": "Ambessa",
        "region": "Noxus",
        "role": "Fighter",
        "title": "the Matriarch of War",
        "voice": "Any enemy of mine is an enemy of my family.",
        "story": "All who know the name Medarda respect and fear the family's leader, Ambessa. As a Noxian general, she embodies a deadly combination of ruthless strength and fearless resolve in battle. Her role as matriarch is no different, requiring great cunning to empower the Medardas while leaving no room for failure or compassion. Embracing the merciless ways of the Wolf, Ambessa will do whatever it takes to protect her family's legacy, even at the cost of her own children's love.",
        "splash_art": "https://raw.githubusercontent.com/VietHung0712/AssetsLOL/refs/heads/main/Splash_Art/A/Ambessa/Ambessa_0.jpg",
        "animated_splash_art": "",
        "position_x": 50,
        "position_y": 5,
        "release_date": "2024-11-06",
        "updated_date": null
    },
    {
        "id": "Amumu",
        "name": "Amumu",
        "region": "Shurima",
        "role": "Tank",
        "title": "the Sad Mummy",
        "voice": "Solitude can be lonelier than death.",
        "story": "Legend claims that Amumu is a lonely and melancholy soul from ancient Shurima, roaming the world in search of a friend. Doomed by an ancient curse to remain alone forever, his touch is death, his affection ruin. Those who claim to have seen him describe a living cadaver, small in stature and wrapped in creeping bandages. Amumu has inspired myths, songs, and folklore told and retold for generations—such that it is impossible to separate truth from fiction.",
        "splash_art": "https://raw.githubusercontent.com/VietHung0712/AssetsLOL/refs/heads/main/Splash_Art/A/Amumu/Amumu_0.jpg",
        "animated_splash_art": "",
        "position_x": 75,
        "position_y": 20,
        "release_date": "2009-06-26",
        "updated_date": null
    },
    {
        "id": "Anivia",
        "name": "Anivia",
        "region": "The_Freljord",
        "role": "Mage",
        "title": "the Cryophoenix",
        "voice": "I am the fury of the blizzard, the bite of the wind, and the cold of the ice. I am the Freljord.",
        "story": "Anivia is a benevolent winged spirit who endures endless cycles of life, death, and rebirth to protect the Freljord. A demigod born of unforgiving ice and bitter winds, she wields those elemental powers to thwart any who dare disturb her homeland. Anivia guides and protects the tribes of the harsh north, who revere her as a symbol of hope, and a portent of great change. She fights with every ounce of her being, knowing that through her sacrifice, her memory will endure, and she will be reborn into a new tomorrow.",
        "splash_art": "https://raw.githubusercontent.com/VietHung0712/AssetsLOL/refs/heads/main/Splash_Art/A/Anivia/Anivia_0.jpg",
        "animated_splash_art": "",
        "position_x": 50,
        "position_y": 20,
        "release_date": "2009-07-10",
        "updated_date": null
    },
    {
        "id": "Annie",
        "name": "Annie",
        "region": "Runeterra",
        "role": "Mage",
        "title": "the Dark Child",
        "voice": "Ashes, ashes, they all fall down.",
        "story": "Dangerous, yet disarmingly precocious, Annie is a child mage with immense pyromantic power. Even in the shadows of the mountains north of Noxus, she is a magical outlier. Her natural affinity for fire manifested early in life through unpredictable, emotional outbursts, though she eventually learned to control these “playful tricks.” Her favorite includes the summoning of her beloved teddy bear, Tibbers, as a fiery protector. Lost in the perpetual innocence of childhood, Annie wanders the dark forests, always looking for someone to play with.",
        "splash_art": "https://raw.githubusercontent.com/VietHung0712/AssetsLOL/refs/heads/main/Splash_Art/A/Annie/Annie_0.jpg",
        "animated_splash_art": "",
        "position_x": 86,
        "position_y": 20,
        "release_date": "2009-02-21",
        "updated_date": null
    },
    {
        "id": "Aphelios",
        "name": "Aphelios",
        "region": "Targon",
        "role": "Marksman",
        "title": "the Weapon of the Faithful",
        "voice": "Our faith is proven fate each time we deny it.",
        "story": "Emerging from moonlight's shadow with weapons drawn, Aphelios kills the enemies of his faith in brooding silence—speaking only through the certainty of his aim, and the firing of each gun. Though fueled by a poison that renders him mute, he is guided by his sister Alune. From her distant temple sanctuary, she pushes an arsenal of moonstone weapons into his hands. For as long as the moon shines overhead, Aphelios will never be alone.\r\nRole\r\n\r\nMarksman\r\n\r\n",
        "splash_art": "https://raw.githubusercontent.com/VietHung0712/AssetsLOL/refs/heads/main/Splash_Art/A/Aphelios/Aphelios_0.jpg",
        "animated_splash_art": "",
        "position_x": 52,
        "position_y": 5,
        "release_date": "2020-01-14",
        "updated_date": null
    },
    {
        "id": "Ashe",
        "name": "Ashe",
        "region": "The_Freljord",
        "role": "Marksman",
        "title": "the Frost Archer",
        "voice": "All the world on one arrow.",
        "story": " Iceborn warmother of the Avarosan tribe, Ashe commands the most populous horde in the north. Stoic, intelligent, and idealistic, yet uncomfortable with her role as leader, she taps into the ancestral magics of her lineage to wield a bow of True Ice. With her people’s belief that she is the mythological hero Avarosa reincarnated, Ashe hopes to unify the Freljord once more by retaking their ancient, tribal lands.",
        "splash_art": "https://raw.githubusercontent.com/VietHung0712/AssetsLOL/refs/heads/main/Splash_Art/A/Ashe/Ashe_0.jpg",
        "animated_splash_art": "",
        "position_x": 70,
        "position_y": 5,
        "release_date": "2009-02-21",
        "updated_date": null
    },
    {
        "id": "AurelionSol",
        "name": "Aurelion Sol",
        "region": "Runeterra",
        "role": "Mage",
        "title": "The Star Forger",
        "voice": "Cower. Worship. Marvel. They are all appropriate responses.",
        "story": " Aurelion Sol once graced the vast emptiness of the celestial realm with wonders of his own devising, but was tricked by the Aspects of Targon into revealing the secrets of a sun that he himself created. His awesome power was channeled into immortal god-warriors to protect the apparently insignificant world of Runeterra—now, desiring a return to his mastery of the cosmos, Aurelion Sol will drag the very stars from the sky, if he must, in order to regain his freedom.",
        "splash_art": "https://raw.githubusercontent.com/VietHung0712/AssetsLOL/refs/heads/main/Splash_Art/A/AurelionSol/AurelionSol_0.jpg",
        "animated_splash_art": "https://cmsassets.rgpub.io/sanity/files/dsfx7636/universe/36e23e03ec34c0951ed9ddae6b94970ba3ef5290.webm",
        "position_x": 62,
        "position_y": 18,
        "release_date": "2016-03-24",
        "updated_date": "2023-10-02"
    },
    {
        "id": "Aurora",
        "name": "Aurora",
        "region": "The_Freljord",
        "role": "Mage",
        "title": "the Witch Between Worlds",
        "voice": "I see the spirit realm and material realm simultaneously. This blended world is my own, and it's beautiful.",
        "story": "From the moment she was born, Aurora navigated life with a unique ability to move between the spirit and material realms. Determined to learn more about the spirit realm's inhabitants, she left her home to further her research and happened upon a wayward demigod who'd become twisted and lost to time. Witnessing his desperation, Aurora resolved to find a way to help her feral friend regain his forgotten identity—a journey that would take her to the farthest reaches of the Freljord.",
        "splash_art": "https://raw.githubusercontent.com/VietHung0712/AssetsLOL/refs/heads/main/Splash_Art/A/Aurora/Aurora_0.jpg",
        "animated_splash_art": "",
        "position_x": 58,
        "position_y": 3,
        "release_date": "2024-07-17",
        "updated_date": null
    },
    {
        "id": "Azir",
        "name": "Azir",
        "region": "Shurima",
        "role": "Mage",
        "title": "the Emperor of the Sands",
        "voice": "Shurima! Your emperor has returned!",
        "story": " Azir was a mortal emperor of Shurima in a far distant age, a proud man who stood at the cusp of immortality. His hubris saw him betrayed and murdered at the moment of his greatest triumph, but now, millennia later, he has been reborn as an Ascended being of immense power. With his buried city risen from the sand, Azir seeks to restore Shurima to its former glory.",
        "splash_art": "https://raw.githubusercontent.com/VietHung0712/AssetsLOL/refs/heads/main/Splash_Art/A/Azir/Azir_0.jpg",
        "animated_splash_art": "https://cmsassets.rgpub.io/sanity/files/dsfx7636/universe/07df115d79f735cf45c50f552d2ebd06b77be955.webm",
        "position_x": 84,
        "position_y": 13,
        "release_date": "2014-09-16",
        "updated_date": null
    },
    {
        "id": "Bard",
        "name": "Bard",
        "region": "Runeterra",
        "role": "Support",
        "title": "the Wandering Caretaker",
        "voice": "The chimes of his footsteps are echoes of change.",
        "story": " Atraveler from beyond the stars, Bard is an agent of serendipity who strives to maintain the harmony between creation, and the cold indifference of what lies beyond it. Many Runeterrans sing songs that ponder his extraordinary nature, yet they all agree that the cosmic vagabond is drawn to artifacts of great magical power. Surrounded by a jubilant choir of helpful meeps, it is impossible to mistake his actions as malevolent, as Bard always serves the greater good… in his own odd way.",
        "splash_art": "https://raw.githubusercontent.com/VietHung0712/AssetsLOL/refs/heads/main/Splash_Art/B/Bard/Bard_0.jpg",
        "animated_splash_art": "https://cmsassets.rgpub.io/sanity/files/dsfx7636/universe/481b1a9abb6d3228c194e899d573a2ca6a9602a9.webm",
        "position_x": 65,
        "position_y": 12,
        "release_date": "2015-03-12",
        "updated_date": null
    },
    {
        "id": "BelVeth",
        "name": "Bel'Veth",
        "region": "The_Void",
        "role": "Fighter",
        "title": "the Empress of the Void",
        "voice": "This world will not be forgotten. I will replace it—a child devouring its parent.",
        "story": "A nightmarish empress created from the raw material of an entire devoured city, Bel'Veth is the end of Runeterra itself... and the beginning of a monstrous reality of her own design. Driven by epochs of repurposed history, knowledge, and memories from the world above, she voraciously feeds an ever-expanding need for new experiences and emotions, consuming all that crosses her path. Yet her wants could never be sated by only one world as she turns her hungry eyes toward the Void's old masters...",
        "splash_art": "https://raw.githubusercontent.com/VietHung0712/AssetsLOL/refs/heads/main/Splash_Art/B/BelVeth/BelVeth_0.jpg",
        "animated_splash_art": "",
        "position_x": 47,
        "position_y": 28,
        "release_date": "2022-04-14",
        "updated_date": null
    },
    {
        "id": "Blitzcrank",
        "name": "Blitzcrank",
        "region": "Zaun",
        "role": "Tank",
        "title": "the Great Steam Golem",
        "voice": "A SINGLE GEAR TURNING CAN MAKE ALL THE DIFFERENCE.",
        "story": "Blitzcrank is an enormous, near-indestructible automaton from Zaun, originally built to dispose of hazardous waste. However, he found this primary purpose too restricting, and modified his own form to better serve the fragile people of the Sump. Blitzcrank selflessly uses his strength and durability to protect others, extending a helpful metal fist or burst of energy to subdue any troublemakers.",
        "splash_art": "https://raw.githubusercontent.com/VietHung0712/AssetsLOL/refs/heads/main/Splash_Art/B/Blitzcrank/Blitzcrank_0.jpg",
        "animated_splash_art": "",
        "position_x": 78,
        "position_y": 16,
        "release_date": "2009-09-02",
        "updated_date": null
    },
    {
        "id": "Brand",
        "name": "Brand",
        "region": "Runeterra",
        "role": "Mage",
        "title": "the Burning Vengeance",
        "voice": "This place will burn, not by cinder flying or breath of wind, but by the vengeance of my hand.",
        "story": "Once a tribesman of the icy Freljord named Kegan Rodhe, the creature known as Brand is a lesson in the temptation of greater power. Seeking one of the legendary World Runes, Kegan betrayed his companions and seized it for himself—and, in an instant, the man was no more. His soul burned away, his body a vessel of living flame, Brand now roams Valoran in search of other Runes, swearing revenge for wrongs he could never possibly have suffered in a dozen mortal lifetimes.",
        "splash_art": "https://raw.githubusercontent.com/VietHung0712/AssetsLOL/refs/heads/main/Splash_Art/B/Brand/Brand_0.jpg",
        "animated_splash_art": "",
        "position_x": 88,
        "position_y": 7,
        "release_date": "2011-04-12",
        "updated_date": null
    },
    {
        "id": "Braum",
        "name": "Braum",
        "region": "The_Freljord",
        "role": "Tank",
        "title": "the Heart of the Freljord",
        "voice": "Today, we fight as enemies. Tomorrow, we may fight as brothers.",
        "story": "Blessed with massive biceps and an even bigger heart, Braum is a beloved Iceborn hero of the Freljord. Every mead hall north of Frostheld toasts his legendary strength and tells tales of how he felled a forest of oaks in a single night, and punched an entire mountain into rubble. With his shield, an enchanted vault door forged in ages past, Braum roams the frozen north as a cheerful protector, helping the vulnerable as he works toward his dream of a peaceful Freljord.",
        "splash_art": "https://raw.githubusercontent.com/VietHung0712/AssetsLOL/refs/heads/main/Splash_Art/B/Braum/Braum_0.jpg",
        "animated_splash_art": "",
        "position_x": 89,
        "position_y": 4,
        "release_date": "2014-05-12",
        "updated_date": null
    },
    {
        "id": "Briar",
        "name": "Briar",
        "region": "Noxus",
        "role": "Fighter",
        "title": "the Restrained Hunger",
        "voice": "I don’t lose control, I free myself from control.",
        "story": "Afailed experiment by the Black Rose, Briar’s uncontrollable bloodlust required a special pillory to focus her frenzied mind. After years of confinement, this living weapon broke free from her restraints and unleashed herself into the world. Now she’s controlled by no one—following only her hunger for knowledge and blood—and relishes the opportunities to let loose, even if reining back the frenzy isn’t easy.\r\n\r\n",
        "splash_art": "https://raw.githubusercontent.com/VietHung0712/AssetsLOL/refs/heads/main/Splash_Art/B/Briar/Briar_0.jpg",
        "animated_splash_art": "",
        "position_x": 56,
        "position_y": 28,
        "release_date": "2023-09-13",
        "updated_date": null
    },
    {
        "id": "Caitlyn",
        "name": "Caitlyn",
        "region": "Piltover",
        "role": "Marksman",
        "title": "the Sheriff of Piltover",
        "voice": "To be the best hunter, you have to be able to think like your prey.",
        "story": "Renowned as its finest peacekeeper, Caitlyn is also Piltover’s best shot at ridding the city of its elusive criminal elements. She is often paired with Vi, acting as a cool counterpoint to her partner’s more impetuous nature. Even though she carries a one-of-a-kind hextech rifle, Caitlyn’s most powerful weapon is her superior intellect, allowing her to lay elaborate traps for any lawbreakers foolish enough to operate in the City of Progress.",
        "splash_art": "https://raw.githubusercontent.com/VietHung0712/AssetsLOL/refs/heads/main/Splash_Art/C/Caitlyn/Caitlyn_0.jpg",
        "animated_splash_art": "",
        "position_x": 80,
        "position_y": 1,
        "release_date": "2011-01-04",
        "updated_date": null
    },
    {
        "id": "Camille",
        "name": "Camille",
        "region": "Piltover",
        "role": "Fighter",
        "title": "the Steel Shadow",
        "voice": "Precision is the difference between a butcher and a surgeon.",
        "story": " Weaponized to operate outside the boundaries of the law, Camille is the Principal Intelligencer of Clan Ferros—an elegant and elite agent who ensures the Piltover machine and its Zaunite underbelly run smoothly. Adaptable and precise, she views sloppy technique as an embarrassment that must be put to order. With a mind as sharp as the blades she bears, Camille's pursuit of superiority through hextech body augmentation has left many to wonder if she is now more machine than human.",
        "splash_art": "https://raw.githubusercontent.com/VietHung0712/AssetsLOL/refs/heads/main/Splash_Art/C/Camille/Camille_0.jpg",
        "animated_splash_art": "https://cmsassets.rgpub.io/sanity/files/dsfx7636/universe/4eff0baf3549e977e23969cdab560b1e9a26123f.webm",
        "position_x": 95,
        "position_y": 1,
        "release_date": "2016-12-07",
        "updated_date": null
    },
    {
        "id": "Cassiopeia",
        "name": "Cassiopeia",
        "region": "Noxus",
        "role": "Mage",
        "title": "the Serpent's Embrace",
        "voice": "Secrets are sharper than blades…",
        "story": "Cassiopeia is a deadly creature bent on manipulating others to her will. Youngest and most beautiful daughter of the noble Du Couteau family of Noxus, she ventured deep into the crypts beneath Shurima in search of ancient power. There, she was bitten by a gruesome tomb guardian, whose venom transformed her into a viper-like predator. Cunning and agile, Cassiopeia now slithers under the veil of night, petrifying her enemies with her baleful gaze.",
        "splash_art": "https://raw.githubusercontent.com/VietHung0712/AssetsLOL/refs/heads/main/Splash_Art/C/Cassiopeia/Cassiopeia_0.jpg",
        "animated_splash_art": "",
        "position_x": 65,
        "position_y": 8,
        "release_date": "2010-12-14",
        "updated_date": null
    },
    {
        "id": "ChoGath",
        "name": "Cho'Gath",
        "region": "The_Void",
        "role": "Tank",
        "title": "the Terror of the Void",
        "voice": "Your souls will feed the Void!",
        "story": "From the moment Cho’Gath first emerged into the harsh light of Runeterra’s sun, the beast was driven by the most pure and insatiable hunger. A perfect expression of the Void’s desire to consume all life, Cho’Gath’s complex biology quickly converts matter into new bodily growth—increasing its muscle mass and density, or hardening its outer carapace like organic diamond. When growing larger does not suit the Void-spawn’s needs, it vomits out the excess material as razor-sharp spines, leaving prey skewered and ready to feast upon later.",
        "splash_art": "https://raw.githubusercontent.com/VietHung0712/AssetsLOL/refs/heads/main/Splash_Art/C/ChoGath/ChoGath_0.jpg",
        "animated_splash_art": "",
        "position_x": 59,
        "position_y": 27,
        "release_date": "2009-06-26",
        "updated_date": null
    },
    {
        "id": "Corki",
        "name": "Corki",
        "region": "Bandle_City",
        "role": "Marksman",
        "title": "the Daring Bombardier",
        "voice": "Death from above!",
        "story": "The yordle pilot Corki loves two things above all others: flying, and his glamorous mustache... though not necessarily in that order. After leaving Bandle City, he settled in Piltover and fell in love with the wondrous machines he found there. He dedicated himself to the development of flying contraptions, leading an aerial defense force of seasoned veterans known as the Screaming Yipsnakes. Calm under fire, Corki patrols the skies around his adopted home, and has never encountered a problem that a good missile barrage couldn't solve.",
        "splash_art": "https://raw.githubusercontent.com/VietHung0712/AssetsLOL/refs/heads/main/Splash_Art/C/Corki/Corki_0.jpg",
        "animated_splash_art": "",
        "position_x": 80,
        "position_y": 13,
        "release_date": "2009-09-19",
        "updated_date": null
    },
    {
        "id": "Darius",
        "name": "Darius",
        "region": "Noxus",
        "role": "Fighter",
        "title": "the Hand of Noxus",
        "voice": "History only remembers the victors. Stand with Noxus, and be remembered forever.",
        "story": "There is no greater symbol of Noxian might than Darius, the nation's most feared and battle-hardened commander. Rising from humble origins to become the Hand of Noxus, he cleaves through the empire's enemies—many of them Noxians themselves. Knowing that he never doubts his cause is just, and never hesitates once his axe is raised, those who stand against the leader of the Trifarian Legion can expect no mercy.",
        "splash_art": "https://raw.githubusercontent.com/VietHung0712/AssetsLOL/refs/heads/main/Splash_Art/D/Darius/Darius_0.jpg",
        "animated_splash_art": "",
        "position_x": 55,
        "position_y": 0,
        "release_date": "2012-05-23",
        "updated_date": null
    },
    {
        "id": "Diana",
        "name": "Diana",
        "region": "Targon",
        "role": "Fighter",
        "title": "Scorn of the Moon",
        "voice": "I am the light coursing in the soul of the moon.",
        "story": "Bearing her crescent moonblade and clad in shimmering armor the color of winter snow at night, Diana is a living embodiment of the silver moon’s power. Imbued with the essence of an Aspect from beyond Targon’s towering summit, Diana is no longer wholly human, and struggles to understand her power and purpose in this world.",
        "splash_art": "https://raw.githubusercontent.com/VietHung0712/AssetsLOL/refs/heads/main/Splash_Art/D/Diana/Diana_0.jpg",
        "animated_splash_art": "https://cmsassets.rgpub.io/sanity/files/dsfx7636/universe/e45ef4c6ec195042d82ca53cfce2ff4cc93bdf74.webm",
        "position_x": 78,
        "position_y": 33,
        "release_date": "2012-08-07",
        "updated_date": null
    },
    {
        "id": "Draven",
        "name": "Draven",
        "region": "Noxus",
        "role": "Marksman",
        "title": "the Glorious Executioner",
        "voice": "'The best' is wherever I decide to set the bar each day.",
        "story": "In Noxus, warriors known as Reckoners face one another in arenas where blood is spilled and strength tested—but none has ever been as celebrated as Draven. A former soldier, he found that the crowds uniquely appreciated his flair for the dramatic, and his unparalleled skill with his spinning axes. Addicted to the spectacle of his own brash perfection, Draven has sworn to defeat whomever he must to ensure that his name is chanted throughout the empire forever more.",
        "splash_art": "https://raw.githubusercontent.com/VietHung0712/AssetsLOL/refs/heads/main/Splash_Art/D/Draven/Draven_0.jpg",
        "animated_splash_art": "",
        "position_x": 80,
        "position_y": 14,
        "release_date": "2012-06-06",
        "updated_date": null
    },
    {
        "id": "DrMundo",
        "name": "Dr. Mundo",
        "region": "Zaun",
        "role": "Fighter",
        "title": "the Madman of Zaun",
        "voice": "Me must be good doctor. Patients never come back.",
        "story": "Utterly mad, tragically homicidal, and horrifyingly purple, Dr. Mundo is what keeps many of Zaun's citizens indoors on particularly dark nights. Now a self-proclaimed physician, he was once a patient of Zaun's most infamous asylum. After \"curing\" the entire staff, Dr. Mundo established his practice in the empty wards that once treated him and began mimicking the highly unethical procedures he had so often experienced himself. With a full cabinet of medicines and zero medical knowledge, he now makes himself more monstrous with each injection and terrifies the hapless \"patients\" who wander near his office.",
        "splash_art": "https://raw.githubusercontent.com/VietHung0712/AssetsLOL/refs/heads/main/Splash_Art/D/DrMundo/DrMundo_0.jpg",
        "animated_splash_art": "",
        "position_x": 54,
        "position_y": 9,
        "release_date": "2009-09-02",
        "updated_date": null
    },
    {
        "id": "Ekko",
        "name": "Ekko",
        "region": "Zaun",
        "role": "Assassin",
        "title": "the Boy Who Shattered Time",
        "voice": "My devices work best when they don’t work as intended… which is most of the time.",
        "story": "A prodigy from the rough streets of Zaun, Ekko is able to manipulate time to twist any situation to his advantage. He uses his own invention, the Z-Drive, to explore the branching possibilities of reality, crafting the perfect moment to seemingly achieve the impossible the first time, every time. Though Ekko revels in this freedom, when there's a threat to those he cares about, he and the Firelights will do anything to defend them.",
        "splash_art": "https://raw.githubusercontent.com/VietHung0712/AssetsLOL/refs/heads/main/Splash_Art/E/Ekko/Ekko_0.jpg",
        "animated_splash_art": "",
        "position_x": 87,
        "position_y": 4,
        "release_date": "2015-05-29",
        "updated_date": null
    },
    {
        "id": "Elise",
        "name": "Elise",
        "region": "Shadow_Isles",
        "role": "Mage",
        "title": "the Spider Queen",
        "voice": "Beauty is power too, and can strike swifter than any sword.",
        "story": "Elise is a deadly predator who dwells in a shuttered, lightless palace, deep within the oldest city of Noxus. She was once the mistress of a powerful noble house, until the bite of a vile spider-god transformed her into something utterly inhuman, yet still beautiful—an arachnoid creature, drawing unsuspecting prey into her web. Elise now feeds upon the naive and the faithless, and there are few who can resist her seductions.",
        "splash_art": "https://raw.githubusercontent.com/VietHung0712/AssetsLOL/refs/heads/main/Splash_Art/E/Elise/Elise_0.jpg",
        "animated_splash_art": "",
        "position_x": 80,
        "position_y": 14,
        "release_date": "2012-10-26",
        "updated_date": null
    },
    {
        "id": "Evelynn",
        "name": "Evelynn",
        "region": "Runeterra",
        "role": "Assassin",
        "title": "Agony's Embrace",
        "voice": "You know you want me.",
        "story": " Within the dark seams of Runeterra, the demon Evelynn searches for her next victim. She lures in prey with the voluptuous façade of a human female, but once a person succumbs to her charms, Evelynn’s true form is unleashed. She then subjects her victim to unspeakable torment, gratifying herself with their pain. To the demon, these liaisons are innocent flings. To the rest of Runeterra, they are ghoulish tales of lust gone awry and horrific reminders of the cost of wanton desire.",
        "splash_art": "https://raw.githubusercontent.com/VietHung0712/AssetsLOL/refs/heads/main/Splash_Art/E/Evelynn/Evelynn_0.jpg",
        "animated_splash_art": "",
        "position_x": 51,
        "position_y": 12,
        "release_date": "2009-05-01",
        "updated_date": null
    },
    {
        "id": "Ezreal",
        "name": "Ezreal",
        "region": "Piltover",
        "role": "Marksman",
        "title": "the Prodigal Explorer",
        "voice": "If I don’t know the rules, then how can I be breaking them?",
        "story": "Adashing adventurer, unknowingly gifted in the magical arts, Ezreal raids long-lost catacombs, tangles with ancient curses, and overcomes seemingly impossible odds with ease. His courage and bravado knowing no bounds, he prefers to improvise his way out of any situation, relying partially on his wits, but mostly on his mystical Shuriman gauntlet, which he uses to unleash devastating arcane blasts. One thing is for sure—whenever Ezreal is around, trouble isn’t too far behind. Or ahead. Probably everywhere.\r\n\r\n",
        "splash_art": "https://raw.githubusercontent.com/VietHung0712/AssetsLOL/refs/heads/main/Splash_Art/E/Ezreal/Ezreal_0.jpg",
        "animated_splash_art": "",
        "position_x": 67,
        "position_y": 20,
        "release_date": "2010-03-16",
        "updated_date": null
    },
    {
        "id": "Fiddlesticks",
        "name": "Fiddlesticks",
        "region": "Runeterra",
        "role": "Mage",
        "title": "the Ancient Fear",
        "voice": "It's hunting us. It knows what we're afraid of.",
        "story": "Something has awoken in Runeterra. Something ancient. Something terrible. The ageless horror known as Fiddlesticks stalks the edges of mortal society, drawn to areas thick with paranoia where it feeds upon terrorized victims. Wielding a jagged scythe, the haggard, makeshift creature reaps fear itself, shattering the minds of those unlucky enough to survive in its wake. Beware the sounding of the crow, or the whispering of the shape that appears almost human… Fiddlesticks has returned.",
        "splash_art": "https://raw.githubusercontent.com/VietHung0712/AssetsLOL/refs/heads/main/Splash_Art/F/Fiddlesticks/Fiddlesticks_0.jpg",
        "animated_splash_art": "",
        "position_x": 37,
        "position_y": 48,
        "release_date": "2009-02-21",
        "updated_date": null
    },
    {
        "id": "Fiora",
        "name": "Fiora",
        "region": "Demacia",
        "role": "Fighter",
        "title": "the Grand Duelist",
        "voice": "I have come to kill you for the sake of honor. And though you possess none, still you die.",
        "story": "The most feared duelist in all Valoran, Fiora is as renowned for her brusque manner and political cunning as she is for the speed of her rapier. Born to the noble Laurent family in Demacia, Fiora claimed the household from her father in the wake of a scandal that nearly destroyed them—now she is dedicated to restoring the Laurents to their rightful place among the great and good of the kingdom.",
        "splash_art": "https://raw.githubusercontent.com/VietHung0712/AssetsLOL/refs/heads/main/Splash_Art/F/Fiora/Fiora_0.jpg",
        "animated_splash_art": "",
        "position_x": 68,
        "position_y": 0,
        "release_date": "2012-02-29",
        "updated_date": null
    },
    {
        "id": "Fizz",
        "name": "Fizz",
        "region": "Runeterra",
        "role": "Assassin",
        "title": "the Tidal Trickster",
        "voice": "You people can’t even breathe water. You’re boring.",
        "story": "Fizz is an amphibious yordle, who dwells among the reefs surrounding Bilgewater. He often retrieves and returns the tithes cast into the sea by superstitious captains, but even the saltiest of sailors know better than to cross him—for many are the tales of those who have underestimated this slippery character. Often mistaken for some manner of capricious ocean spirit, he seems able to command the beasts of the deep, and delights in confounding his allies and enemies alike.",
        "splash_art": "https://raw.githubusercontent.com/VietHung0712/AssetsLOL/refs/heads/main/Splash_Art/F/Fizz/Fizz_0.jpg",
        "animated_splash_art": "",
        "position_x": 95,
        "position_y": 15,
        "release_date": "2011-11-15",
        "updated_date": null
    },
    {
        "id": "Galio",
        "name": "Galio",
        "region": "Demacia",
        "role": "Tank",
        "title": "the Colossus",
        "voice": "Get behind me, Demacian! You may not have noticed, but I’m very large.",
        "story": "Outside the gleaming city of Demacia, the stone colossus Galio keeps vigilant watch. Built as a bulwark against enemy mages, he often stands motionless for decades until the presence of powerful magic stirs him to life. Once activated, Galio makes the most of his time, savoring the thrill of a fight and the rare honor of defending his countrymen. But his triumphs are always bittersweet, for the magic he destroys is also his source of reanimation, and each victory leaves him dormant once again.",
        "splash_art": "https://raw.githubusercontent.com/VietHung0712/AssetsLOL/refs/heads/main/Splash_Art/G/Galio/Galio_0.jpg",
        "animated_splash_art": "",
        "position_x": 48,
        "position_y": 9,
        "release_date": "2010-08-10",
        "updated_date": null
    },
    {
        "id": "Gangplank",
        "name": "Gangplank",
        "region": "Bilgewater",
        "role": "Fighter",
        "title": "the Saltwater Scourge",
        "voice": "I was cutting throats and sinking Noxian war galleys when you were still pissing your britches, boy. You don’t want to take me on.",
        "story": "As unpredictable as he is brutal, the dethroned reaver king Gangplank is feared far and wide. Once, he ruled the port city of Bilgewater, and while his reign is over, there are those who believe this has only made him more dangerous. Gangplank would see Bilgewater bathed in blood once more before letting someone else take it—and now with pistol, cutlass, and barrels of gunpowder, he is determined to reclaim what he has lost.",
        "splash_art": "https://raw.githubusercontent.com/VietHung0712/AssetsLOL/refs/heads/main/Splash_Art/G/Gangplank/Gangplank_0.jpg",
        "animated_splash_art": "",
        "position_x": 78,
        "position_y": 1,
        "release_date": "2009-08-19",
        "updated_date": null
    },
    {
        "id": "Garen",
        "name": "Garen",
        "region": "Demacia",
        "role": "Fighter",
        "title": "The Might of Demacia",
        "voice": "This kingdom, and its people, have given me everything. What kind of man would I be if I gave any less in return?",
        "story": "Aproud and noble soldier, Garen fights at the head of the Dauntless Vanguard. He is popular among his fellows, and respected well enough by his enemies—not least as a scion of the prestigious Crownguard family, entrusted with defending Demacia and its ideals. Clad in magic-resistant armor and bearing a mighty broadsword, Garen stands ready to confront mages and sorcerers on the field of battle, in a veritable whirlwind of righteous steel.",
        "splash_art": "https://raw.githubusercontent.com/VietHung0712/AssetsLOL/refs/heads/main/Splash_Art/G/Garen/Garen_0.jpg",
        "animated_splash_art": "",
        "position_x": 90,
        "position_y": 20,
        "release_date": "2010-04-27",
        "updated_date": null
    },
    {
        "id": "Gnar",
        "name": "Gnar",
        "region": "The_Freljord",
        "role": "Fighter",
        "title": "the Missing Link",
        "voice": "Gnar!",
        "story": "Gnar is a primeval yordle whose playful antics can erupt into a toddler's outrage in an instant, transforming him into a massive beast bent on destruction. Frozen in True Ice for millennia, the curious creature broke free and now hops about a changed world he sees as exotic and wondrous. Delighted by danger, Gnar flings whatever he can at his enemies, be it his bonetooth boomerang, or a nearby building.",
        "splash_art": "https://raw.githubusercontent.com/VietHung0712/AssetsLOL/refs/heads/main/Splash_Art/G/Gnar/Gnar_0.jpg",
        "animated_splash_art": null,
        "position_x": 85,
        "position_y": 68,
        "release_date": "2014-08-14",
        "updated_date": null
    },
    {
        "id": "Gragas",
        "name": "Gragas",
        "region": "The_Freljord",
        "role": "Fighter",
        "title": "the Rabble Rouser",
        "voice": "Now this'll put hair on your chest!",
        "story": "Equal parts jolly and imposing, Gragas is a massive, rowdy brewmaster on his own quest for the perfect pint of ale. Hailing from parts unknown, he now searches for rare ingredients among the unblemished wastes of the Freljord, trying each recipe as he goes. Often intoxicated and extremely impulsive, he is legendary for the brawls he starts, which often end in all-night parties and widespread property damage. Any appearance from Gragas must surely foreshadow drinking and destruction—in that order.",
        "splash_art": "https://raw.githubusercontent.com/VietHung0712/AssetsLOL/refs/heads/main/Splash_Art/G/Gragas/Gragas_0.jpg",
        "animated_splash_art": null,
        "position_x": 65,
        "position_y": 2,
        "release_date": "2010-02-02",
        "updated_date": null
    },
    {
        "id": "Graves",
        "name": "Graves",
        "region": "Bilgewater",
        "role": "Marksman",
        "title": "the Outlaw",
        "voice": "We’re here for your gold, not your heads… so don’t nobody decide to be a hero.",
        "story": "Malcolm Graves is a renowned mercenary, gambler, and thief—a wanted man in every city and empire he has visited. Even though he has an explosive temper, he possesses a strict sense of criminal honor, often enforced at the business end of his double-barreled shotgun Destiny. In recent years, he has reconciled a troubled partnership with Twisted Fate, and together they have prospered once more in the turmoil of Bilgewater's criminal underbelly.",
        "splash_art": "https://raw.githubusercontent.com/VietHung0712/AssetsLOL/refs/heads/main/Splash_Art/G/Graves/Graves_0.jpg",
        "animated_splash_art": null,
        "position_x": 84,
        "position_y": 0,
        "release_date": "2011-10-19",
        "updated_date": null
    },
    {
        "id": "Gwen",
        "name": "Gwen",
        "region": "Shadow_Isles",
        "role": "Fighter",
        "title": "The Hallowed Seamstress",
        "voice": "The wind at my back feels so good. I can’t lose this. I won’t.",
        "story": "A former doll transformed and brought to life by magic, Gwen wields the very tools that once created her. She carries the weight of her maker's love with every step, taking nothing for granted. At her command is the Hallowed Mist, an ancient and protective magic that has blessed Gwen's scissors, needles, and sewing thread. So much is new to her, but Gwen remains joyfully determined to fight for the good that survives in a broken world.",
        "splash_art": "https://raw.githubusercontent.com/VietHung0712/AssetsLOL/refs/heads/main/Splash_Art/G/Gwen/Gwen_0.jpg",
        "animated_splash_art": "",
        "position_x": 50,
        "position_y": 15,
        "release_date": "2021-04-15",
        "updated_date": null
    },
    {
        "id": "Hecarim",
        "name": "Hecarim",
        "region": "Shadow_Isles",
        "role": "Fighter",
        "title": "the Shadow of War",
        "voice": "Break their ranks, and ride them down without mercy. Crush the living. Feast on their terror.",
        "story": "Hecarim is a spectral fusion of man and beast, cursed to ride down the souls of the living for all eternity. When the Blessed Isles fell into shadow, this proud knight was obliterated by the destructive energies of the Ruination, along with all his cavalry and their mounts. Now, whenever the Black Mist reaches out across Runeterra, he leads their devastating charge, reveling in the slaughter and crushing the foe beneath his armored hooves.",
        "splash_art": "https://raw.githubusercontent.com/VietHung0712/AssetsLOL/refs/heads/main/Splash_Art/H/Hecarim/Hecarim_0.jpg",
        "animated_splash_art": null,
        "position_x": 68,
        "position_y": 2,
        "release_date": "2012-04-18",
        "updated_date": null
    },
    {
        "id": "Heimerdinger",
        "name": "Heimerdinger",
        "region": "Piltover",
        "role": "Mage",
        "title": "the Revered Inventor",
        "voice": "Impossible, you say? Nonsense. Just wait till you see my calculations!",
        "story": "The eccentric Professor Cecil B. Heimerdinger is one of the most innovative and esteemed inventors the world has ever known. As the longest serving member of the Council of Piltover, he saw the best and the worst of the city's unending desire for progress. Nonetheless, this brilliant scientist and teacher will always remain dedicated to using his unconventional devices to improve the lives of others.",
        "splash_art": "https://raw.githubusercontent.com/VietHung0712/AssetsLOL/refs/heads/main/Splash_Art/H/Heimerdinger/Heimerdinger_0.jpg",
        "animated_splash_art": null,
        "position_x": 80,
        "position_y": 35,
        "release_date": "2009-10-10",
        "updated_date": null
    },
    {
        "id": "Hwei",
        "name": "Hwei",
        "region": "Ionia",
        "role": "Mage",
        "title": "the Visionary",
        "voice": "Calm and chaos—leave everything on the canvas.",
        "story": "Hwei is a brooding painter who creates brilliant art in order to confront Ionia's criminals and comfort their victims. Beneath his melancholy roils a torn, emotional mind—haunted by both the vibrant visions of his imagination and the gruesome memories of his temple's massacre. Hwei seeks to understand this light and dark, which drives him inevitably toward the artist who unraveled him. With paintbrush and palette, Hwei shapes endless possibilities as he draws ever closer to earning closure or embracing despair.",
        "splash_art": "https://raw.githubusercontent.com/VietHung0712/AssetsLOL/refs/heads/main/Splash_Art/H/Hwei/Hwei_0.jpg",
        "animated_splash_art": "",
        "position_x": 60,
        "position_y": 0,
        "release_date": "2023-12-06",
        "updated_date": null
    },
    {
        "id": "Illaoi",
        "name": "Illaoi",
        "region": "Bilgewater",
        "role": "Fighter",
        "title": "the Kraken Priestess",
        "voice": "Wisdom is frequently a kick in the head.",
        "story": "Illaoi's powerful physique is dwarfed only by her indomitable faith. As the prophet of the Great Kraken, she uses a huge, golden idol to rip her foes' spirits from their bodies and shatter their perception of reality. All who challenge the “Truth Bearer of Nagakabouros” soon discover Illaoi never battles alone—the god of the Serpent Isles fights by her side.",
        "splash_art": "https://raw.githubusercontent.com/VietHung0712/AssetsLOL/refs/heads/main/Splash_Art/I/Illaoi/Illaoi_0.jpg",
        "animated_splash_art": null,
        "position_x": 64,
        "position_y": 0,
        "release_date": "2015-11-24",
        "updated_date": null
    },
    {
        "id": "Irelia",
        "name": "Irelia",
        "region": "Ionia",
        "role": "Fighter",
        "title": "the Blade Dancer",
        "voice": "Fight for the First Lands!",
        "story": " The Noxian occupation of Ionia produced many heroes, none more unlikely than young Irelia of Navori. Trained in the ancient dances of her province, she adapted her art for war, using the graceful and carefully practised movements to levitate a host of deadly blades. After proving herself as a fighter, she was thrust into the role of resistance leader and figurehead, and to this day remains dedicated to the preservation of her homeland.",
        "splash_art": "https://raw.githubusercontent.com/VietHung0712/AssetsLOL/refs/heads/main/Splash_Art/I/Irelia/Irelia_0.jpg",
        "animated_splash_art": "https://cmsassets.rgpub.io/sanity/files/dsfx7636/universe/03cc763c5e5a5914e4de4f5598abe1b8cc99adeb.webm",
        "position_x": 50,
        "position_y": 12,
        "release_date": "2010-11-16",
        "updated_date": null
    },
    {
        "id": "Ivern",
        "name": "Ivern",
        "region": "Ionia",
        "role": "Support",
        "title": "the Green Father",
        "voice": "The cleverness of mushrooms always surprises me.",
        "story": "Ivern Bramblefoot, known to many as the Green Father, is a peculiar half man, half tree who roams Runeterra's forests, cultivating life everywhere he goes. He knows the secrets of the natural world, and holds deep friendships with all things that grow, fly, and scuttle. Ivern wanders the wilderness, imparting strange wisdom to any he meets, enriching the forests, and occasionally entrusting loose-lipped butterflies with his secrets.",
        "splash_art": "https://raw.githubusercontent.com/VietHung0712/AssetsLOL/refs/heads/main/Splash_Art/I/Ivern/Ivern_0.jpg",
        "animated_splash_art": "https://cmsassets.rgpub.io/sanity/files/dsfx7636/universe/a2021849f16b1d3cfe4e70dbc97fc32f8bfb8b86.webm",
        "position_x": 50,
        "position_y": 0,
        "release_date": "2016-10-05",
        "updated_date": null
    },
    {
        "id": "Janna",
        "name": "Janna",
        "region": "Zaun",
        "role": "Support",
        "title": "the Storm's Fury",
        "voice": "The tempest is at your command.",
        "story": " An ancient and mysterious wind spirit, Janna has come to protect the dispossessed of Zaun. While her presence is most often felt as a soothing breeze or a ferocious tempest, she also can manifest in corporeal form as an ethereal figure, comforting the downtrodden. Over the eons, Janna has witnessed the rise and fall of civilizations. Through it all, she remains steadfast as a beacon of hope to those in need.",
        "splash_art": "https://raw.githubusercontent.com/VietHung0712/AssetsLOL/refs/heads/main/Splash_Art/J/Janna/Janna_0.jpg",
        "animated_splash_art": "",
        "position_x": 92,
        "position_y": 21,
        "release_date": "2009-09-02",
        "updated_date": null
    },
    {
        "id": "JarvanIV",
        "name": "Jarvan IV",
        "region": "Demacia",
        "role": "Fighter",
        "title": "the Exemplar of Demacia",
        "voice": "Words may make a ruler, but only actions make history.",
        "story": "Prince Jarvan, scion of the Lightshield dynasty, is heir apparent to the throne of Demacia. Raised to be a paragon of his nation's greatest virtues, he is forced to balance the heavy expectations placed upon him with his own desire to fight on the front lines. Jarvan inspires his troops with his fearsome courage and selfless determination, raising his family's colors high and revealing his true strength as a future leader of his people.",
        "splash_art": "https://raw.githubusercontent.com/VietHung0712/AssetsLOL/refs/heads/main/Splash_Art/J/JarvanIV/JarvanIV_0.jpg",
        "animated_splash_art": null,
        "position_x": 83,
        "position_y": 5,
        "release_date": "2011-03-01",
        "updated_date": null
    },
    {
        "id": "Jax",
        "name": "Jax",
        "region": "Runeterra",
        "role": "Fighter",
        "title": "Grandmaster at Arms",
        "voice": "Strength and will are what make a weapon.",
        "story": "Unmatched in both his skill with unique armaments and his biting sarcasm, Jax is the last known weapons master of Icathia. After his homeland was laid low by its own hubris in unleashing the Void, Jax and his kind vowed to protect what little remained. As magic now rises in the world, this slumbering threat stirs once more, and Jax roams Valoran, wielding the last light of Icathia and testing all warriors he meets to see if any are strong enough to stand beside him...",
        "splash_art": "https://raw.githubusercontent.com/VietHung0712/AssetsLOL/refs/heads/main/Splash_Art/J/Jax/Jax_0.jpg",
        "animated_splash_art": null,
        "position_x": 69,
        "position_y": 32,
        "release_date": "2009-02-21",
        "updated_date": null
    },
    {
        "id": "Jayce",
        "name": "Jayce",
        "region": "Piltover",
        "role": "Fighter",
        "title": "the Defender of Tomorrow",
        "voice": "Picking a fight with me is the dumbest thing you’ve done today – and that’s saying a lot.",
        "story": "Jayce Talis is a brilliant inventor who, along with his friend Viktor, made the first great discoveries in the field of hextech. Celebrated across Piltover, he tries to live up to his reputation as \"the Man of Progress,\" but often struggles with the expectations placed upon him. Because of this, Jayce has begun to see the ways in which his invention has furthered the division between Piltover and Zaun—and armed with his hextech hammer, he stands ready to defend tomorrow.",
        "splash_art": "https://raw.githubusercontent.com/VietHung0712/AssetsLOL/refs/heads/main/Splash_Art/J/Jayce/Jayce_0.jpg",
        "animated_splash_art": "https://cmsassets.rgpub.io/sanity/files/dsfx7636/universe/f5322735accb4ca58f0d5a68e2c233d21d507f2d.webm",
        "position_x": 83,
        "position_y": 25,
        "release_date": "2012-07-07",
        "updated_date": null
    },
    {
        "id": "Jhin",
        "name": "Jhin",
        "region": "Ionia",
        "role": "Marksman",
        "title": "the Virtuoso",
        "voice": "In carnage, I bloom, like a flower in the dawn.",
        "story": " Jhin is a meticulous criminal psychopath who believes murder is art. Once an Ionian prisoner, but freed by shadowy elements within Ionia’s ruling council, the serial killer now works as their cabal's assassin. Using his gun as his paintbrush, Jhin creates works of artistic brutality, horrifying victims and onlookers. He gains a cruel pleasure from putting on his gruesome theater, making him the ideal choice to send the most powerful of messages: terror.",
        "splash_art": "https://raw.githubusercontent.com/VietHung0712/AssetsLOL/refs/heads/main/Splash_Art/J/Jhin/Jhin_0.jpg",
        "animated_splash_art": "https://cmsassets.rgpub.io/sanity/files/dsfx7636/universe/20a1802bcbb42e21ae66152dffa25671d3b924b7.webm",
        "position_x": 64,
        "position_y": 0,
        "release_date": "2016-02-01",
        "updated_date": null
    },
    {
        "id": "Jinx",
        "name": "Jinx",
        "region": "Zaun",
        "role": "Marksman",
        "title": "the Loose Cannon",
        "voice": "Volatile explosives are a girl’s best friend!",
        "story": "An unhinged and impulsive criminal from the undercity, Jinx is haunted by the consequences of her past—but that doesn't stop her from bringing her own chaotic brand of pandemonium to Piltover and Zaun. She uses her arsenal of DIY weapons to devastating effect, unleashing torrents of colorful explosions and gunfire, inspiring the disenfranchised to rebellion and resistance with the mayhem she leaves in her wake.",
        "splash_art": "https://raw.githubusercontent.com/VietHung0712/AssetsLOL/refs/heads/main/Splash_Art/J/Jinx/Jinx_0.jpg",
        "animated_splash_art": "https://cmsassets.rgpub.io/sanity/files/dsfx7636/universe/26d3e24ee65154e21211df06994f8f1ef8aee380.webm",
        "position_x": 74,
        "position_y": 11,
        "release_date": "2013-10-10",
        "updated_date": null
    },
    {
        "id": "KaiSa",
        "name": "Kai'Sa",
        "region": "The_Void",
        "role": "Marksman",
        "title": "Daughter of the Void",
        "voice": "My appearance may frighten you, but make no mistake—I am on your side, and we fight to the bitter en",
        "story": "Claimed by the Void when she was only a child, Kai’Sa managed to survive through sheer tenacity and strength of will. Her experiences have made her a deadly hunter and, to some, the harbinger of a future they would rather not live to see. Having entered into an uneasy symbiosis with a living Void carapace, the time will soon come when she must decide whether to forgive those mortals who would call her a monster, and defeat the coming darkness together… or simply to forget, as the Void consumes the world that left her behind.",
        "splash_art": "https://raw.githubusercontent.com/VietHung0712/AssetsLOL/refs/heads/main/Splash_Art/K/KaiSa/KaiSa_0.jpg",
        "animated_splash_art": "https://cmsassets.rgpub.io/sanity/files/dsfx7636/universe/aae82f09c0b6efdb47f0f6a58afbf2bdae3595e1.webm",
        "position_x": 49,
        "position_y": 18,
        "release_date": "2018-03-07",
        "updated_date": null
    },
    {
        "id": "Kalista",
        "name": "Kalista",
        "region": "Shadow_Isles",
        "role": "Marksman",
        "title": "the Spear of Vengeance",
        "voice": "Turncoats, oath breakers and betrayers… we hate them all.",
        "story": "An undying specter of wrath and retribution, Kalista is an armored nightmare summoned from the Shadow Isles to hunt deceivers and traitors. The betrayed may cry out in blood to be avenged, but Kalista only answers those willing to pay with their very souls. Those who become the focus of Kalista’s wrath should make their final peace, for any pact sealed with this grim hunter can only be ended by the cold, piercing fire of her soul-spears.",
        "splash_art": "https://raw.githubusercontent.com/VietHung0712/AssetsLOL/refs/heads/main/Splash_Art/K/Kalista/Kalista_0.jpg",
        "animated_splash_art": "https://cmsassets.rgpub.io/sanity/files/dsfx7636/universe/2153d9c1e61ab3d41b6909b6d7b38e6acba465c0.webm",
        "position_x": 70,
        "position_y": 7,
        "release_date": "2014-11-05",
        "updated_date": null
    },
    {
        "id": "Karma",
        "name": "Karma",
        "region": "Ionia",
        "role": "Mage",
        "title": "the Enlightened One",
        "voice": "As Ionia changes, so must I.",
        "story": " No mortal exemplifies the spiritual traditions of Ionia more than Karma. She is the living embodiment of an ancient soul reincarnated countless times, carrying all her accumulated memories into each new life, and blessed with power that few can comprehend. She has done her best to guide her people in recent times of crisis, though she knows that peace and harmony may come only at a considerable cost—both to her, and to the land she holds most dear.",
        "splash_art": "https://raw.githubusercontent.com/VietHung0712/AssetsLOL/refs/heads/main/Splash_Art/K/Karma/Karma_0.jpg",
        "animated_splash_art": "",
        "position_x": 84,
        "position_y": 2,
        "release_date": "2011-02-01",
        "updated_date": null
    },
    {
        "id": "Karthus",
        "name": "Karthus",
        "region": "Shadow_Isles",
        "role": "Mage",
        "title": "the Deathsinger",
        "voice": "Death is not the end of the journey, it is just the beginning...",
        "story": "The harbinger of oblivion, Karthus is an undying spirit whose haunting songs are a prelude to the horror of his nightmarish appearance. The living fear the eternity of undeath, but Karthus sees only beauty and purity in its embrace, a perfect union of life and death. When Karthus emerges from the Shadow Isles, it is to bring the joy of death to mortals, an apostle of the unliving.",
        "splash_art": "https://raw.githubusercontent.com/VietHung0712/AssetsLOL/refs/heads/main/Splash_Art/K/Karthus/Karthus_0.jpg",
        "animated_splash_art": null,
        "position_x": 74,
        "position_y": 0,
        "release_date": "2009-06-12",
        "updated_date": null
    },
    {
        "id": "Kassadin",
        "name": "Kassadin",
        "region": "The_Void",
        "role": "Assassin",
        "title": "the Void Walker",
        "voice": "There are few indeed who may tread the paths between worlds.",
        "story": "Cutting a burning swath through the darkest places of the world, Kassadin knows his days are numbered. A widely traveled Shuriman guide and adventurer, he had chosen to raise a family among the peaceful southern tribes—until the day his village was consumed by the Void. He vowed vengeance, combining a number of arcane artifacts and forbidden technologies for the struggle ahead. Finally, Kassadin set out for the wastelands of Icathia, ready to face any monstrous Void-construct in his search for their self-proclaimed prophet, Malzahar.",
        "splash_art": "https://raw.githubusercontent.com/VietHung0712/AssetsLOL/refs/heads/main/Splash_Art/K/Kassadin/Kassadin_0.jpg",
        "animated_splash_art": null,
        "position_x": 65,
        "position_y": 9,
        "release_date": "2009-08-07",
        "updated_date": null
    },
    {
        "id": "Katarina",
        "name": "Katarina",
        "region": "Noxus",
        "role": "Assassin",
        "title": "the Sinister Blade",
        "voice": "Violence solves everything.",
        "story": "Decisive in judgment and lethal in combat, Katarina is a Noxian assassin of the highest caliber. Eldest daughter to the legendary General Du Couteau, she made her talents known with swift kills against unsuspecting enemies. Her fiery ambition has driven her to pursue heavily-guarded targets, even at the risk of endangering her allies—but no matter the mission, Katarina will not hesitate to execute her duty amid a whirlwind of serrated daggers.",
        "splash_art": "https://raw.githubusercontent.com/VietHung0712/AssetsLOL/refs/heads/main/Splash_Art/K/Katarina/Katarina_0.jpg",
        "animated_splash_art": "",
        "position_x": 65,
        "position_y": 30,
        "release_date": "2009-09-19",
        "updated_date": null
    },
    {
        "id": "Kayle",
        "name": "Kayle",
        "region": "Demacia",
        "role": "Fighter",
        "title": "The Righteous",
        "voice": "No human is perfect. But I am not human.",
        "story": "Born to a Targonian Aspect at the height of the Rune Wars, Kayle honored her mother’s legacy by fighting for justice on wings of divine flame. She and her twin sister Morgana were the protectors of Demacia for many years—until Kayle became disillusioned with the repeated failings of mortals, and abandoned this realm altogether. Still, legends are told of her punishing the unjust with her fiery swords, and many hope that she will one day return…",
        "splash_art": "https://raw.githubusercontent.com/VietHung0712/AssetsLOL/refs/heads/main/Splash_Art/K/Kayle/Kayle_0.jpg",
        "animated_splash_art": "",
        "position_x": 15,
        "position_y": 20,
        "release_date": "2009-02-21",
        "updated_date": null
    },
    {
        "id": "Kayn",
        "name": "Kayn",
        "region": "Ionia",
        "role": "Assassin",
        "title": "the Shadow Reaper",
        "voice": "Will you prove worthy? - Probably not.",
        "story": "Apeerless practitioner of lethal shadow magic, Shieda Kayn battles to achieve his true destiny—to one day lead the Order of Shadow into a new era of Ionian supremacy. He wields the sentient darkin weapon Rhaast, undeterred by its creeping corruption of his body and mind. There are only two possible outcomes: either Kayn bends the weapon to his will... or the malevolent blade consumes him completely, paving the way for the destruction of all Runeterra.",
        "splash_art": "https://raw.githubusercontent.com/VietHung0712/AssetsLOL/refs/heads/main/Splash_Art/K/Kayn/Kayn_0.jpg",
        "animated_splash_art": "",
        "position_x": 51,
        "position_y": 51,
        "release_date": "2017-07-12",
        "updated_date": null
    },
    {
        "id": "Kennen",
        "name": "Kennen",
        "region": "Ionia",
        "role": "Mage",
        "title": "the Heart of the Tempest",
        "voice": "I exist across realms, in the space between lightning’s strike and thunder’s call, the true balance within the storm.",
        "story": "More than just the lightning-quick enforcer of Ionian balance, Kennen is the only yordle member of the Kinkou. Despite his small, furry stature, he is eager to take on any threat with a whirling storm of shuriken and boundless enthusiasm. Alongside his master Shen, Kennen patrols the spirit realm, employing devastating electrical energy to strike down his enemies.",
        "splash_art": "https://raw.githubusercontent.com/VietHung0712/AssetsLOL/refs/heads/main/Splash_Art/K/Kennen/Kennen_0.jpg",
        "animated_splash_art": "",
        "position_x": 80,
        "position_y": 10,
        "release_date": "2010-04-08",
        "updated_date": null
    },
    {
        "id": "KhaZix",
        "name": "Kha'Zix",
        "region": "The_Void",
        "role": "Assassin",
        "title": "the Voidreaver",
        "voice": "Kill. Consume. Adapt.",
        "story": "The Void grows, and the Void adapts—in none of its myriad spawn are these truths more apparent than Kha'Zix. Evolution drives the core of this mutating horror, born to survive and to slay the strong. Where it struggles to do so, it grows new, more effective ways to counter and kill its prey. Initially a mindless beast, Kha'Zix's intelligence has developed as much as its form. Now, the creature plans out its hunts, and even utilizes the visceral terror it engenders in its victims.",
        "splash_art": "https://raw.githubusercontent.com/VietHung0712/AssetsLOL/refs/heads/main/Splash_Art/K/KhaZix/KhaZix_0.jpg",
        "animated_splash_art": "",
        "position_x": 81,
        "position_y": 45,
        "release_date": "2012-09-27",
        "updated_date": null
    },
    {
        "id": "Kindred",
        "name": "Kindred",
        "region": "Runeterra",
        "role": "Marksman",
        "title": "The Eternal Hunters",
        "voice": "Tell me again, little Lamb, which things are ours to take?”\r\n“All things, dear Wolf.",
        "story": "Separate, but never parted, Kindred represents the twin essences of death. Lamb's bow offers a swift release from the mortal realm for those who accept their fate. Wolf hunts down those who run from their end, delivering violent finality within his crushing jaws. Though interpretations of Kindred's nature vary across Runeterra, every mortal must choose the true face of their death.",
        "splash_art": "https://raw.githubusercontent.com/VietHung0712/AssetsLOL/refs/heads/main/Splash_Art/K/Kindred/Kindred_0.jpg",
        "animated_splash_art": null,
        "position_x": 81,
        "position_y": 31,
        "release_date": "2015-10-14",
        "updated_date": null
    },
    {
        "id": "Kled",
        "name": "Kled",
        "region": "Noxus",
        "role": "Fighter",
        "title": "the Cantankerous Cavalier",
        "voice": "A sane man would run… but I ain’t the runnin’ kind!",
        "story": "A warrior as fearless as he is ornery, the yordle Kled embodies the furious bravado of Noxus. He is an icon beloved by the empire's soldiers, distrusted by its officers, and loathed by the nobility. Many claim Kled has fought in every campaign the legions have waged, has “acquired” every military title, and has never once backed down from a fight. Though the truth of the matter is often questionable, one part of his legend is undeniable: Charging into battle on his un-trusty steed, Skaarl, Kled fights to protect what's his… and to take whatever he can get.",
        "splash_art": "https://raw.githubusercontent.com/VietHung0712/AssetsLOL/refs/heads/main/Splash_Art/K/Kled/Kled_0.jpg",
        "animated_splash_art": "",
        "position_x": 87,
        "position_y": 1,
        "release_date": "2023-01-12",
        "updated_date": null
    },
    {
        "id": "KogMaw",
        "name": "Kog'Maw",
        "region": "The_Void",
        "role": "Marksman",
        "title": "the Mouth of the Abyss",
        "voice": "If that's just hungry, I don't want to see angry.",
        "story": "Belched forth from a rotting Void incursion deep in the wastelands of Icathia, Kog’Maw is an inquisitive yet putrid creature with a caustic, gaping mouth. This particular Void-spawn needs to gnaw and drool on anything within reach to truly understand it. Though not inherently evil, Kog’Maw’s beguiling naiveté is dangerous, as it often precedes a feeding frenzy—not for sustenance, but to satisfy its unending curiosity.",
        "splash_art": "https://raw.githubusercontent.com/VietHung0712/AssetsLOL/refs/heads/main/Splash_Art/K/KogMaw/KogMaw_0.jpg",
        "animated_splash_art": "",
        "position_x": 73,
        "position_y": 68,
        "release_date": "2010-06-24",
        "updated_date": null
    },
    {
        "id": "KSante",
        "name": "K'Sante",
        "region": "Shurima",
        "role": "Fighter",
        "title": "the Pride of Nazumah",
        "voice": "No monster greater than pride.",
        "story": "Defiant and courageous, K'Sante battles colossal beasts and ruthless Ascended to protect his home of Nazumah, a coveted oasis amid the sands of Shurima. But after a falling-out with his former partner, K'Sante realizes that in order to become a warrior worthy of leading his city, he must temper his single-minded drive for success. Only then can he avoid falling prey to his own pride and find the wisdom he needs to defeat the vicious monsters threatening his people.",
        "splash_art": "https://raw.githubusercontent.com/VietHung0712/AssetsLOL/refs/heads/main/Splash_Art/K/KSante/KSante_0.jpg",
        "animated_splash_art": "",
        "position_x": 30,
        "position_y": 15,
        "release_date": "2022-10-18",
        "updated_date": null
    },
    {
        "id": "LeBlanc",
        "name": "LeBlanc",
        "region": "Noxus",
        "role": "Assassin",
        "title": "the Deceiver",
        "voice": "A rose cannot grow in darkness. It dies, and the darkness grows…",
        "story": "Mysterious even to other members of the Black Rose cabal, LeBlanc is but one of many names for a pale woman who has manipulated people and events since the earliest days of Noxus. Using her magic to mirror herself, the sorceress can appear to anyone, anywhere, and even be in many places at once. Always plotting just out of sight, LeBlanc’s true motives are as inscrutable as her shifting identity.",
        "splash_art": "https://raw.githubusercontent.com/VietHung0712/AssetsLOL/refs/heads/main/Splash_Art/L/LeBlanc/LeBlanc_0.jpg",
        "animated_splash_art": "",
        "position_x": 50,
        "position_y": 10,
        "release_date": "2010-11-02",
        "updated_date": "2025-04-02"
    },
    {
        "id": "LeeSin",
        "name": "Lee Sin",
        "region": "Ionia",
        "role": "Fighter",
        "title": "the Blind Monk",
        "voice": "Enlightenment is knowing the value of one’s ignorance.",
        "story": "A master of Ionia's ancient martial arts, Lee Sin is a principled fighter who channels the essence of the dragon spirit to face any challenge. Though he lost his sight many years ago, the warrior-monk has devoted his life to protecting his homeland against any who would dare upset its sacred balance. Enemies who underestimate his meditative demeanor will endure his fabled burning fists and blazing roundhouse kicks.",
        "splash_art": "https://raw.githubusercontent.com/VietHung0712/AssetsLOL/refs/heads/main/Splash_Art/L/LeeSin/LeeSin_0.jpg",
        "animated_splash_art": "",
        "position_x": 70,
        "position_y": 0,
        "release_date": "2011-04-01",
        "updated_date": null
    },
    {
        "id": "Leona",
        "name": "Leona",
        "region": "Targon",
        "role": "Tank",
        "title": "the Radiant Dawn",
        "voice": "By the light of the Sun, the world is beheld.",
        "story": " Imbued with the fire of the sun, Leona is a holy warrior of the Solari who defends Mount Targon with her Zenith Blade and the Shield of Daybreak. Her skin shimmers with starfire while her eyes burn with the power of the celestial Aspect within her. Armored in gold and bearing a terrible burden of ancient knowledge, Leona brings enlightenment to some, death to others.",
        "splash_art": "https://raw.githubusercontent.com/VietHung0712/AssetsLOL/refs/heads/main/Splash_Art/L/Leona/Leona_0.jpg",
        "animated_splash_art": "",
        "position_x": 80,
        "position_y": 0,
        "release_date": "2011-07-13",
        "updated_date": null
    },
    {
        "id": "Lillia",
        "name": "Lillia",
        "region": "Ionia",
        "role": "Mage",
        "title": "the Bashful Bloom",
        "voice": "When the humans bloom, it’s so beautiful… I can help them! Maybe. Possibly? Perhaps…",
        "story": "Intensely shy, the fae fawn Lillia skittishly wanders Ionia’s forests. Hiding just out of sight of mortals—whose mysterious natures have long captivated, but intimidated, her—Lillia hopes to discover why their dreams no longer reach the ancient Dreaming Tree. She now travels Ionia with a magical branch in hand, in an effort to find people’s unrealized dreams. Only then can Lillia herself bloom and help others untangle their fears to find the sparkle within. Eep!",
        "splash_art": "https://raw.githubusercontent.com/VietHung0712/AssetsLOL/refs/heads/main/Splash_Art/L/Lillia/Lillia_0.jpg",
        "animated_splash_art": "",
        "position_x": 45,
        "position_y": 21,
        "release_date": "2020-07-22",
        "updated_date": null
    },
    {
        "id": "Lissandra",
        "name": "Lissandra",
        "region": "The_Freljord",
        "role": "Mage",
        "title": "the Ice Witch",
        "voice": "So many secrets, buried in ice...",
        "story": "As the reclusive leader of the Frostguard, many believe Lissandra is a living saint whose followers bring healing and wisdom to the tribes of the Freljord. The truth is perhaps more sinister, as she uses her elemental magic to twist the power of True Ice into something dark and terrible, entombing or impaling any who would reveal her deepest secrets. Indeed, the legacy of her past may yet be the beginning of the end for Runeterra.",
        "splash_art": "https://raw.githubusercontent.com/VietHung0712/AssetsLOL/refs/heads/main/Splash_Art/L/Lissandra/Lissandra_0.jpg",
        "animated_splash_art": "https://cmsassets.rgpub.io/sanity/files/dsfx7636/universe/1b9c8895ce26e74dca730702c72c6ce05003d8eb.webm",
        "position_x": 70,
        "position_y": 0,
        "release_date": "2013-04-30",
        "updated_date": null
    },
    {
        "id": "Lucian",
        "name": "Lucian",
        "region": "Runeterra",
        "role": "Marksman",
        "title": "the Purifier",
        "voice": "Wield the light, endure the pain, and cleanse all shadow from this world.",
        "story": "Lucian, a Sentinel of Light, is a grim hunter of undying spirits, pursuing them relentlessly and annihilating them with his twin relic pistols. After the wraith Thresh slew his wife, Lucian embarked on the path of vengeance—but even with her return to life, his rage is undiminished. Merciless and single-minded, Lucian will stop at nothing to protect the living from the long-dead horrors of the Black Mist.",
        "splash_art": "https://raw.githubusercontent.com/VietHung0712/AssetsLOL/refs/heads/main/Splash_Art/L/Lucian/Lucian_0.jpg",
        "animated_splash_art": "https://cmsassets.rgpub.io/sanity/files/dsfx7636/universe_live/dc0f76989a923cc4ce7fb6ed294757bdb0be8741.webm",
        "position_x": 71,
        "position_y": 37,
        "release_date": "2013-08-22",
        "updated_date": null
    },
    {
        "id": "Lulu",
        "name": "Lulu",
        "region": "Bandle_City",
        "role": "Support",
        "title": "the Fae Sorceress",
        "voice": "The best path between two points is upside-down, between, then inside-out and round again.",
        "story": "The yordle mage Lulu is known for conjuring dreamlike illusions and fanciful creatures as she roams Runeterra with her fairy companion Pix. Lulu shapes reality on a whim, warping the fabric of the world, and what she views as the constraints of this mundane, physical realm. While others might consider her magic at best unnatural, and at worst dangerous, she believes everyone could use a touch of enchantment.",
        "splash_art": "https://raw.githubusercontent.com/VietHung0712/AssetsLOL/refs/heads/main/Splash_Art/L/Lulu/Lulu_0.jpg",
        "animated_splash_art": "",
        "position_x": 75,
        "position_y": 24,
        "release_date": "2012-03-20",
        "updated_date": null
    },
    {
        "id": "Lux",
        "name": "Lux",
        "region": "Demacia",
        "role": "Mage",
        "title": "the Lady of Luminosity",
        "voice": "The light inside is what makes me different, and I’m always careful where I shine it.",
        "story": "Luxanna Crownguard hails from Demacia, an insular realm where magical abilities are viewed with fear and suspicion. Able to bend light to her will, she grew up dreading discovery and exile, and was forced to keep her power secret in order to preserve her family’s noble status. Nonetheless, Lux’s optimism and resilience have led her to embrace her unique talents, and she now seeks to bring greater tolerance and understanding to her homeland.",
        "splash_art": "https://raw.githubusercontent.com/VietHung0712/AssetsLOL/refs/heads/main/Splash_Art/L/Lux/Lux_0.jpg",
        "animated_splash_art": "",
        "position_x": 66,
        "position_y": 7,
        "release_date": "2010-10-19",
        "updated_date": null
    },
    {
        "id": "Malphite",
        "name": "Malphite",
        "region": "Ixtal",
        "role": "Tank",
        "title": "Shard of the Monolith",
        "voice": "Beware, minions of chaos! The Shard of the Monolith has come.",
        "story": "A massive creature of living stone, Malphite struggles to impose blessed order on a chaotic world. Birthed as a servitor-shard to an otherworldly obelisk known as the Monolith, he used his tremendous elemental strength to maintain and protect his progenitor, but ultimately failed. The only survivor of the destruction that followed, Malphite now endures Runeterra's soft folk and their fluid temperaments, while struggling to find a new role worthy of the last of his kind.",
        "splash_art": "https://raw.githubusercontent.com/VietHung0712/AssetsLOL/refs/heads/main/Splash_Art/M/Malphite/Malphite_0.jpg",
        "animated_splash_art": "",
        "position_x": 73,
        "position_y": 60,
        "release_date": "2009-09-02",
        "updated_date": null
    },
    {
        "id": "Malzahar",
        "name": "Malzahar",
        "region": "The_Void",
        "role": "Mage",
        "title": "the Prophet of the Void",
        "voice": "We are timeless. We demand sacrifice.",
        "story": "A zealous seer dedicated to the unification of all life, Malzahar truly believes the newly emergent Void to be the path to Runeterra's salvation. In the desert wastes of Shurima, he followed the voices that whispered in his mind, all the way to ancient Icathia. Amidst the ruins of that land, he gazed into the dark heart of the Void itself, and was gifted new power and purpose. Malzahar now sees himself as a shepherd, empowered to bring others into the fold… or to release the voidling creatures that dwell beneath.",
        "splash_art": "https://raw.githubusercontent.com/VietHung0712/AssetsLOL/refs/heads/main/Splash_Art/M/Malzahar/Malzahar_0.jpg",
        "animated_splash_art": null,
        "position_x": 70,
        "position_y": 0,
        "release_date": "2010-06-01",
        "updated_date": null
    },
    {
        "id": "Maokai",
        "name": "Maokai",
        "region": "Shadow_Isles",
        "role": "Tank",
        "title": "the Twisted Treant",
        "voice": "All around me are empty husks, soulless and unafraid... but I will bring them fear.",
        "story": "Maokai is a rageful, towering treant who fights the unnatural horrors of the Shadow Isles. He was twisted into a force of vengeance after a magical cataclysm destroyed his home, surviving undeath only through the Waters of Life infused within his heartwood. Once a peaceful nature spirit, Maokai now furiously battles to banish the scourge of unlife from the Shadow Isles and restore his home to its former beauty.",
        "splash_art": "https://raw.githubusercontent.com/VietHung0712/AssetsLOL/refs/heads/main/Splash_Art/M/Maokai/Maokai_0.jpg",
        "animated_splash_art": "",
        "position_x": 65,
        "position_y": 20,
        "release_date": "2011-02-16",
        "updated_date": null
    },
    {
        "id": "MasterYi",
        "name": "Master Yi",
        "region": "Ionia",
        "role": "Assassin",
        "title": "the Wuju Bladesman",
        "voice": "The edge of the sharpest blade is no match for the calm of the peaceful mind.",
        "story": "Master Yi has tempered his body and sharpened his mind, so that thought and action have become almost as one. Though he chooses to enter into violence only as a last resort, the grace and speed of his blade ensures resolution is always swift. As one of the last living practitioners of the Ionian art of Wuju, Yi has devoted his life to continuing the legacy of his people—scrutinizing potential new disciples with the Seven Lenses of Insight to identify the most worthy among them.",
        "splash_art": "https://raw.githubusercontent.com/VietHung0712/AssetsLOL/refs/heads/main/Splash_Art/M/MasterYi/MasterYi_0.jpg",
        "animated_splash_art": "",
        "position_x": 90,
        "position_y": 0,
        "release_date": "2009-02-21",
        "updated_date": null
    },
    {
        "id": "Mel",
        "name": "Mel",
        "region": "Noxus",
        "role": "Mage",
        "title": "the Soul's Reflection",
        "voice": "The wolf, the fox–both necessary, both unrelenting.",
        "story": "Mel Medarda is the presumed heir of the Medarda family, once one of the most powerful in Noxus. In appearance she is a graceful aristocrat, but beneath the surface lies a skilled politician who makes it her business to know everything about everyone she meets. After an encounter with the mysterious Black Rose, Mel discovered the depths of her mother's deception and, for once, faced a situation potentially beyond her control. With newly awakened magical abilities, she sailed home in search of answers—and though many still seek to temper the light within her, Mel's soul remains forever defiant.",
        "splash_art": "https://raw.githubusercontent.com/VietHung0712/AssetsLOL/refs/heads/main/Splash_Art/M/Mel/Mel_0.jpg",
        "animated_splash_art": null,
        "position_x": 37,
        "position_y": 12,
        "release_date": "2025-01-23",
        "updated_date": null
    },
    {
        "id": "Milio",
        "name": "Milio",
        "region": "Ixtal",
        "role": "Support",
        "title": "The Gentle Flame",
        "voice": "The light inside us, our inner flame... That's the heart of my fire.",
        "story": "Milio is a warmhearted boy from Ixtal who has, despite his young age, mastered the fire axiom and discovered something new: soothing fire. With this newfound power, Milio plans to help his family escape their exile by joining the Yun Tal—just like his grandmother once did. Having traveled through the Ixtal jungles to the capital of Ixaocan, Milio now prepares to face the Vidalion and join the Yun Tal, unaware of the trials—and dangers—that await him.",
        "splash_art": "https://raw.githubusercontent.com/VietHung0712/AssetsLOL/refs/heads/main/Splash_Art/M/Milio/Milio_0.jpg",
        "animated_splash_art": "",
        "position_x": 50,
        "position_y": 25,
        "release_date": "2023-03-22",
        "updated_date": null
    },
    {
        "id": "MissFortune",
        "name": "Miss Fortune",
        "region": "Bilgewater",
        "role": "Marksman",
        "title": "the Bounty Hunter",
        "voice": "Fortune doesn't favor fools.",
        "story": "ABilgewater captain famed for her looks but feared for her ruthlessness, Sarah Fortune paints a stark figure among the hardened criminals of the port city. As a child, she witnessed the reaver king Gangplank murder her family—an act she brutally avenged years later, blowing up his flagship while he was still aboard. Those who underestimate her will face a beguiling and unpredictable opponent… and, likely, a bullet or two in their guts.",
        "splash_art": "https://raw.githubusercontent.com/VietHung0712/AssetsLOL/refs/heads/main/Splash_Art/M/MissFortune/MissFortune_0.jpg",
        "animated_splash_art": "",
        "position_x": 81,
        "position_y": 32,
        "release_date": "2010-09-08",
        "updated_date": null
    },
    {
        "id": "Mordekaiser",
        "name": "Mordekaiser",
        "region": "Noxus",
        "role": "Fighter",
        "title": "the Iron Revenant",
        "voice": "Destiny. Domination. Deceit.",
        "story": "Twice slain and thrice born, Mordekaiser is a brutal warlord from a foregone epoch who uses his necromantic sorcery to bind souls into an eternity of servitude. Few now remain who remember his earlier conquests, or know the true extent of his powers—but there are some ancient souls that do, and they fear the day when he may return to claim dominion over both the living and the dead.",
        "splash_art": "https://raw.githubusercontent.com/VietHung0712/AssetsLOL/refs/heads/main/Splash_Art/M/Mordekaiser/Mordekaiser_0.jpg",
        "animated_splash_art": null,
        "position_x": 46,
        "position_y": 8,
        "release_date": "2010-02-24",
        "updated_date": null
    },
    {
        "id": "Morgana",
        "name": "Morgana",
        "region": "Demacia",
        "role": "Mage",
        "title": "The Fallen",
        "voice": "Only those you love can break your heart.",
        "story": "Conflicted between her celestial and mortal natures, Morgana bound her wings to embrace humanity, and inflicts her pain and bitterness upon the dishonest and the corrupt. She rejects laws and traditions she believes are unjust, and fights for truth from the shadows of Demacia—even as others seek to repress it—by casting shields and chains of dark fire. More than anything else, Morgana truly believes that even the banished and outcast may one day rise again.",
        "splash_art": "https://raw.githubusercontent.com/VietHung0712/AssetsLOL/refs/heads/main/Splash_Art/M/Morgana/Morgana_0.jpg",
        "animated_splash_art": "",
        "position_x": 80,
        "position_y": 30,
        "release_date": "2009-02-21",
        "updated_date": null
    },
    {
        "id": "Naafiri",
        "name": "Naafiri",
        "region": "Shurima",
        "role": "Assassin",
        "title": "the Hound of a Hundred Bites",
        "voice": "We track for a thousand years. None can flee for that long.",
        "story": "Across the sands of Shurima, a chorus of howls rings out. It is the call of the dune hounds, voracious predators who form packs and compete for the right to hunt in these barren lands. Among them, one pack stands above all, for they are driven not only by canine instincts, but by the ancient power of the Darkin.",
        "splash_art": "https://raw.githubusercontent.com/VietHung0712/AssetsLOL/refs/heads/main/Splash_Art/N/Naafiri/Naafiri_0.jpg",
        "animated_splash_art": null,
        "position_x": 25,
        "position_y": 51,
        "release_date": "2023-07-19",
        "updated_date": null
    },
    {
        "id": "Nami",
        "name": "Nami",
        "region": "Runeterra",
        "role": "Support",
        "title": "the Tidecaller",
        "voice": "I decide what the tide will bring.",
        "story": "Aheadstrong young vastaya of the seas, Nami was the first of the Marai tribe to leave the waves and venture onto dry land, when their ancient accord with the Targonians was broken. With no other option, she took it upon herself to complete the sacred ritual that would ensure the safety of her people. Amidst the chaos of this new age, Nami faces an uncertain future with grit and determination, using her Tidecaller staff to summon the strength of the oceans themselves.",
        "splash_art": "https://raw.githubusercontent.com/VietHung0712/AssetsLOL/refs/heads/main/Splash_Art/N/Nami/Nami_0.jpg",
        "animated_splash_art": "https://cmsassets.rgpub.io/sanity/files/dsfx7636/universe/eee325cd231728fe0639a9ced9d77532a12db909.webm",
        "position_x": 85,
        "position_y": 15,
        "release_date": "2012-12-07",
        "updated_date": null
    },
    {
        "id": "Nasus",
        "name": "Nasus",
        "region": "Shurima",
        "role": "Fighter",
        "title": "the Curator of the Sands",
        "voice": "For centuries, I have watched. We approach a time of reckoning.",
        "story": "Nasus is an imposing, jackal-headed Ascended being from ancient Shurima, a heroic figure regarded as a demigod by the people of the desert. Fiercely intelligent, he was a guardian of knowledge and peerless strategist whose wisdom guided the ancient empire of Shurima to greatness for many centuries. After the fall of the empire, he went into self-imposed exile, becoming little more than a legend. Now that the ancient city of Shurima has risen once more, he has returned, determined to ensure it never falls again.",
        "splash_art": "https://raw.githubusercontent.com/VietHung0712/AssetsLOL/refs/heads/main/Splash_Art/N/Nasus/Nasus_0.jpg",
        "animated_splash_art": null,
        "position_x": 73,
        "position_y": 6,
        "release_date": "2009-10-01",
        "updated_date": null
    },
    {
        "id": "Nautilus",
        "name": "Nautilus",
        "region": "Bilgewater",
        "role": "Tank",
        "title": "the Titan of the Depths",
        "voice": "When consumed by utter darkness, there is nothing left but forward.",
        "story": " Alonely legend as old as the first piers sunk in Bilgewater, the armored goliath known as Nautilus roams the dark waters off the coast of the Blue Flame Isles. Driven by a forgotten betrayal, he strikes without warning, swinging his enormous anchor to save the wretched, and drag the greedy to their doom. It is said he comes for those who forget to pay the “Bilgewater tithe”, pulling them down beneath the waves with him—an iron-clad reminder that none can escape the depths.",
        "splash_art": "https://raw.githubusercontent.com/VietHung0712/AssetsLOL/refs/heads/main/Splash_Art/N/Nautilus/Nautilus_0.jpg",
        "animated_splash_art": "",
        "position_x": 83,
        "position_y": 1,
        "release_date": "2012-02-14",
        "updated_date": null
    },
    {
        "id": "Neeko",
        "name": "Neeko",
        "region": "Ixtal",
        "role": "Mage",
        "title": "the Curious Chameleon",
        "voice": "The Oovi-Kat are gone. Neeko must build her own tribe, now.",
        "story": "Hailing from a long lost tribe of vastaya, Neeko can blend into any crowd by borrowing the appearances of others, even absorbing something of their emotional state to tell friend from foe in an instant. No one is ever sure where—or who—Neeko might be, but those who intend to do her harm will soon witness her true colors revealed, and feel the full power of her primordial spirit magic unleashed upon them.",
        "splash_art": "https://raw.githubusercontent.com/VietHung0712/AssetsLOL/refs/heads/main/Splash_Art/N/Neeko/Neeko_0.jpg",
        "animated_splash_art": "",
        "position_x": 44,
        "position_y": 0,
        "release_date": "2018-11-21",
        "updated_date": null
    },
    {
        "id": "Nidalee",
        "name": "Nidalee",
        "region": "Ixtal",
        "role": "Mage",
        "title": "the Bestial Huntress",
        "voice": "The untamed know no fear.",
        "story": "Raised in the deepest wilderness, Nidalee is a master tracker who can shapeshift into a ferocious pakaa jungle cat at will. Neither wholly woman nor beast, she viciously defends her territory from any and all trespassers, with carefully placed traps and deft spear throws. She cripples her quarry before pouncing on them in feline form—the lucky few who survive tell tales of a wild woman with razor-sharp instincts, and even sharper claws...",
        "splash_art": "https://raw.githubusercontent.com/VietHung0712/AssetsLOL/refs/heads/main/Splash_Art/N/Nidalee/Nidalee_0.jpg",
        "animated_splash_art": "",
        "position_x": 84,
        "position_y": 2,
        "release_date": "2009-12-17",
        "updated_date": null
    },
    {
        "id": "Nilah",
        "name": "Nilah",
        "region": "Bilgewater",
        "role": "Marksman",
        "title": "the Joy Unbound",
        "voice": "Bliss in life, and bliss forever after.",
        "story": "Nilah is an ascetic warrior from a distant land, seeking the world’s deadliest, most titanic opponents so that she might challenge and destroy them. Having won her power through an encounter with the long-imprisoned demon of joy, she has no emotions other than unceasing jubilation—a small price to pay for the vast strength she now possesses. Channeling the demon’s liquid form into a blade of unparalleled might, she stands defiant against ancient threats long forgotten.",
        "splash_art": "https://raw.githubusercontent.com/VietHung0712/AssetsLOL/refs/heads/main/Splash_Art/N/Nilah/Nilah_0.jpg",
        "animated_splash_art": "",
        "position_x": 68,
        "position_y": 28,
        "release_date": "2022-08-11",
        "updated_date": null
    },
    {
        "id": "Nocturne",
        "name": "Nocturne",
        "region": "Runeterra",
        "role": "Assassin",
        "title": "the Eternal Nightmare",
        "voice": "The darkness is closing in...",
        "story": "A demonic amalgamation drawn from the nightmares that haunt every sentient mind, the thing known as Nocturne has become a primordial force of pure evil. It is liquidly chaotic in aspect, a faceless shadow with cold eyes and armed with wicked-looking blades. After freeing itself from the spirit realm, Nocturne descended upon the waking world, to feed upon the kind of terror that can only thrive in true darkness.",
        "splash_art": "https://raw.githubusercontent.com/VietHung0712/AssetsLOL/refs/heads/main/Splash_Art/N/Nocturne/Nocturne_0.jpg",
        "animated_splash_art": "",
        "position_x": 65,
        "position_y": 30,
        "release_date": "2011-03-15",
        "updated_date": null
    },
    {
        "id": "Nunu",
        "name": "Nunu",
        "region": "The_Freljord",
        "role": "Tank",
        "title": "the Boy and His Yeti",
        "voice": "Pull the fur outta your earholes, Willump! This is gonna be the bestest story ever!",
        "story": "Once upon a time, there was a boy who wanted to prove he was a hero by slaying a fearsome monster—only to discover that the beast, a lonely and magical yeti, merely needed a friend. Bound together by ancient power and a shared love of snowballs, Nunu and Willump now ramble wildly across the Freljord, breathing life into imagined adventures. They hope that somewhere out there, they will find Nunu's mother. If they can save her, maybe they will be heroes after all…",
        "splash_art": "https://raw.githubusercontent.com/VietHung0712/AssetsLOL/refs/heads/main/Splash_Art/N/Nunu/Nunu_0.jpg",
        "animated_splash_art": null,
        "position_x": 69,
        "position_y": 63,
        "release_date": "2009-02-21",
        "updated_date": null
    },
    {
        "id": "Olaf",
        "name": "Olaf",
        "region": "The_Freljord",
        "role": "Fighter",
        "title": null,
        "voice": "When you meet your ancestors, tell them Olaf sent you.",
        "story": "An unstoppable force of destruction, the axe-wielding Olaf wants nothing but to die in glorious combat. Hailing from the brutal Freljordian peninsula of Lokfar, he once received a prophecy foretelling his peaceful passing—a coward's fate, and a great insult among his people. Seeking death, and fueled by rage, he rampaged across the land, slaughtering scores of great warriors and legendary beasts in search of any opponent who could stop him. Now a brutal enforcer for the Winter's Claw, he seeks his end in the great wars to come.",
        "splash_art": "https://raw.githubusercontent.com/VietHung0712/AssetsLOL/refs/heads/main/Splash_Art/O/Olaf/Olaf_0.jpg",
        "animated_splash_art": null,
        "position_x": 67,
        "position_y": 9,
        "release_date": "2010-06-09",
        "updated_date": null
    },
    {
        "id": "Orianna",
        "name": "Orianna",
        "region": "Piltover",
        "role": "Mage",
        "title": "the Lady of Clockwork",
        "voice": "When a moth emerges from its chrysalis, does it remember its life as a caterpillar?",
        "story": "Once a curious girl of flesh and blood, Orianna is now a technological marvel composed entirely of clockwork. She became gravely ill after an accident in the lower districts of Zaun, and her failing body had to be replaced with exquisite artifice, piece by piece. Accompanied by the extraordinary brass orb that houses her hextech arsenal, Orianna is now free to explore the wonders of Piltover, and beyond.",
        "splash_art": "https://raw.githubusercontent.com/VietHung0712/AssetsLOL/refs/heads/main/Splash_Art/O/Orianna/Orianna_0.jpg",
        "animated_splash_art": "",
        "position_x": 80,
        "position_y": 0,
        "release_date": "2011-06-01",
        "updated_date": null
    },
    {
        "id": "Ornn",
        "name": "Ornn",
        "region": "The_Freljord",
        "role": "Tank",
        "title": "The Fire below the Mountain",
        "voice": "I have said enough.",
        "story": "Ornn is the Freljordian spirit of forging and craftsmanship. He works in the solitude of a massive smithy, hammered out from the lava caverns beneath the volcano Hearth-Home. There he stokes bubbling cauldrons of molten rock to purify ores and fashion items of unsurpassed quality. When other deities—especially Volibear—walk the earth and meddle in mortal affairs, Ornn arises to put these impetuous beings back in their place, either with his trusty hammer or the fiery power of the mountains themselves.",
        "splash_art": "https://raw.githubusercontent.com/VietHung0712/AssetsLOL/refs/heads/main/Splash_Art/O/Ornn/Ornn_0.jpg",
        "animated_splash_art": null,
        "position_x": 49,
        "position_y": 30,
        "release_date": "2017-08-23",
        "updated_date": null
    },
    {
        "id": "Pantheon",
        "name": "Pantheon",
        "region": "Targon",
        "role": "Fighter",
        "title": "the Unbreakable Spear",
        "voice": "Here is my eternity… a day the gods will remember!",
        "story": "Once an unwilling host to the Aspect of War, Atreus survived when the celestial power within him was slain, refusing to succumb to a blow that tore stars from the heavens. In time, he learned to embrace the power of his own mortality, and the stubborn resilience that goes along with it. Atreus now opposes the divine as Pantheon reborn, his unbreakable will fueling the fallen Aspect's weapons on the field of battle.",
        "splash_art": "https://raw.githubusercontent.com/VietHung0712/AssetsLOL/refs/heads/main/Splash_Art/P/Pantheon/Pantheon_0.jpg",
        "animated_splash_art": "",
        "position_x": 51,
        "position_y": 25,
        "release_date": "2010-02-02",
        "updated_date": null
    },
    {
        "id": "Poppy",
        "name": "Poppy",
        "region": "Demacia",
        "role": "Tank",
        "title": "Keeper of the Hammer",
        "voice": "I’m no hero. Just a yordle with a hammer.",
        "story": "Runeterra has no shortage of valiant champions, but few are as tenacious as Poppy. Bearing the legendary hammer of Orlon, a weapon twice her size, this determined yordle has spent untold years searching in secret for the fabled “Hero of Demacia,” said to be its rightful wielder. Until then, she dutifully charges into battle, pushing back the kingdom's enemies with every whirling strike.",
        "splash_art": "https://raw.githubusercontent.com/VietHung0712/AssetsLOL/refs/heads/main/Splash_Art/P/Poppy/Poppy_0.jpg",
        "animated_splash_art": null,
        "position_x": 72,
        "position_y": 0,
        "release_date": "2011-05-10",
        "updated_date": null
    },
    {
        "id": "Pyke",
        "name": "Pyke",
        "region": "Bilgewater",
        "role": "Assassin",
        "title": "the Bloodharbor Ripper",
        "voice": "There’s plenty of room for everyone at the bottom of the sea...",
        "story": "A renowned harpooner from the slaughter docks of Bilgewater, Pyke should have met his death in the belly of a gigantic jaull-fish… and yet, he returned. Now, stalking the dank alleys and backways of his former hometown, he uses his new supernatural gifts to bring a swift and gruesome end to those who make their fortune by exploiting others—and a city that prides itself on hunting monsters now finds a monster hunting them.",
        "splash_art": "https://raw.githubusercontent.com/VietHung0712/AssetsLOL/refs/heads/main/Splash_Art/P/Pyke/Pyke_0.jpg",
        "animated_splash_art": "https://cmsassets.rgpub.io/sanity/files/dsfx7636/universe/282d238345547cda81281506f0ea7b0ba1d1c20e.webm",
        "position_x": 49,
        "position_y": 22,
        "release_date": "2018-05-31",
        "updated_date": null
    },
    {
        "id": "Qiyana",
        "name": "Qiyana",
        "region": "Ixtal",
        "role": "Assassin",
        "title": "The Empress of Elements",
        "voice": "Some day, all this will be Ixaocan. A glorious empire, with an empress to fit.",
        "story": "In the jungle city of Ixaocan, Qiyana plots her own ruthless path to the high seat of the Yun Tal. Last in line to succeed her parents, she faces those who stand in her way with brash confidence and unprecedented mastery over elemental magic. With the land itself obeying her every command, Qiyana sees herself as the greatest elementalist in the history of Ixaocan—and by that right, deserving of not only a city, but an empire.",
        "splash_art": "https://raw.githubusercontent.com/VietHung0712/AssetsLOL/refs/heads/main/Splash_Art/Q/Qiyana/Qiyana_0.jpg",
        "animated_splash_art": "",
        "position_x": 51,
        "position_y": 23,
        "release_date": "2019-07-17",
        "updated_date": null
    },
    {
        "id": "Quinn",
        "name": "Quinn",
        "region": "Demacia",
        "role": "Marksman",
        "title": "Demacia's Wings",
        "voice": "Most soldiers only rely on their weapons. Few truly rely on each other.",
        "story": " Sponsored by the noble Buvelle family, Quinn is a ranger-knight of Demacia who undertakes dangerous missions deep in enemy territory. She and her legendary eagle, Valor, share an unbreakable bond, and their foes are often slain before they realize they are fighting not one, but two of the kingdom’s greatest heroes. Nimble and acrobatic, Quinn takes aim with her crossbow while Valor marks their elusive targets from above, making them a deadly pair on the battlefield.",
        "splash_art": "https://raw.githubusercontent.com/VietHung0712/AssetsLOL/refs/heads/main/Splash_Art/Q/Quinn/Quinn_0.jpg",
        "animated_splash_art": "https://cmsassets.rgpub.io/sanity/files/dsfx7636/universe/183765feb69482fa1ff8c0a752ddfe22030084c5.webm",
        "position_x": 66,
        "position_y": 0,
        "release_date": "2013-07-30",
        "updated_date": null
    },
    {
        "id": "Rakan",
        "name": "Rakan",
        "region": "Ionia",
        "role": "Support",
        "title": "the Charmer",
        "voice": "Why do you never say yes?",
        "story": " As mercurial as he is charming, Rakan is an infamous vastayan troublemaker and the greatest battle-dancer in Lhotlan tribal history. To the humans of the Ionian highlands, his name had long been synonymous with wild festivals, uncontrollable parties, and anarchic music. But this energetic, traveling showman has left his old life behind, dedicating himself to the cause of his lover, the rebel Xayah. Together, they seek to free Ionia’s wild magic, restoring the vastaya’s birthright.",
        "splash_art": "https://raw.githubusercontent.com/VietHung0712/AssetsLOL/refs/heads/main/Splash_Art/R/Rakan_Xayah/Rakan_Xayah_0.jpg",
        "animated_splash_art": "",
        "position_x": 41,
        "position_y": 10,
        "release_date": "2017-09-27",
        "updated_date": null
    },
    {
        "id": "Rammus",
        "name": "Rammus",
        "region": "Shurima",
        "role": "Tank",
        "title": "the Armordillo",
        "voice": "OK.",
        "story": "Idolized by many, dismissed by some, mystifying to all, the curious being Rammus is an enigma. Protected by a spiked shell, he inspires increasingly disparate theories on his origin wherever he goes—from demigod, to sacred oracle, to a mere beast transformed by magic. Whatever the truth may be, Rammus keeps his own counsel and stops for no one as he roams the Shuriman desert.",
        "splash_art": "https://raw.githubusercontent.com/VietHung0712/AssetsLOL/refs/heads/main/Splash_Art/R/Rammus/Rammus_0.jpg",
        "animated_splash_art": null,
        "position_x": 64,
        "position_y": 29,
        "release_date": "2011-08-01",
        "updated_date": null
    },
    {
        "id": "RekSai",
        "name": "Rek'Sai",
        "region": "The_Void",
        "role": "Fighter",
        "title": "the Void Burrower",
        "voice": "Fear not ambush from the hills, nor winged beasts from the skies. The true terror of Shurima comes from the sand, and gives no warning of her presence.",
        "story": "An apex predator, Rek'Sai is a merciless Void-spawn that tunnels beneath the ground to ambush and devour unsuspecting prey. Her insatiable hunger has laid waste to entire regions of the once-great empire of Shurima—merchants, traders, even armed caravans, will go hundreds of miles out of their way to avoid her and her offspring's hunting grounds. All know that once Rek'Sai is seen on the horizon, death from below is all but guaranteed.",
        "splash_art": "https://raw.githubusercontent.com/VietHung0712/AssetsLOL/refs/heads/main/Splash_Art/R/RekSai/RekSai_0.jpg",
        "animated_splash_art": "https://cmsassets.rgpub.io/sanity/files/dsfx7636/universe/527c81674b4c59fa77850d30a23811f37d6ddcc8.webm",
        "position_x": 55,
        "position_y": 33,
        "release_date": "2014-10-27",
        "updated_date": null
    },
    {
        "id": "Rell",
        "name": "Rell",
        "region": "Noxus",
        "role": "Support",
        "title": "the Iron Maiden",
        "voice": "Forge your heart into something strong. Unbreakable.",
        "story": " The product of brutal experimentation at the hands of the Black Rose, Rell is a defiant, living weapon determined to topple Noxus. Her childhood was one of misery and horror, enduring unspeakable procedures to perfect and weaponize her magical control over metal... until she made a violent escape, killing many of her captors in the process. Now branded as a criminal, Rell attacks Noxian soldiers on sight as she searches for survivors of her old “academy”, defending the meek while delivering merciless death to her former instructors.",
        "splash_art": "https://raw.githubusercontent.com/VietHung0712/AssetsLOL/refs/heads/main/Splash_Art/R/Rell/Rell_0.jpg",
        "animated_splash_art": "",
        "position_x": 49,
        "position_y": 13,
        "release_date": "2020-10-28",
        "updated_date": null
    },
    {
        "id": "RenataGlasc",
        "name": "Renata Glasc",
        "region": "Zaun",
        "role": "Support",
        "title": "the Chem-Baroness",
        "voice": "We don't have to be enemies. Let me change your mind.",
        "story": "Renata Glasc rose from the ashes of her childhood home with nothing but her name and her parents’ alchemical research. In the decades since, she has become Zaun’s wealthiest chem-baron, a business magnate who built her power by tying everyone’s interests to her own. Work with her, and be rewarded beyond measure. Work against her, and live to regret it. But everyone comes to her side, eventually.",
        "splash_art": "https://raw.githubusercontent.com/VietHung0712/AssetsLOL/refs/heads/main/Splash_Art/R/RenataGlasc/RenataGlasc_0.jpg",
        "animated_splash_art": "",
        "position_x": 54,
        "position_y": 14,
        "release_date": "2022-02-17",
        "updated_date": null
    },
    {
        "id": "Renekton",
        "name": "Renekton",
        "region": "Shurima",
        "role": "Fighter",
        "title": "the Butcher of the Sands",
        "voice": "Blood! And vengeance!",
        "story": "Renekton is a terrifying, rage-fueled Ascended being from the scorched deserts of Shurima. Once, he was his empire's most esteemed warrior, leading the nation's armies to countless victories. However, after the empire's fall, Renekton was entombed beneath the sands, and slowly, as the world turned and changed, he succumbed to insanity. Now free once more, he is utterly consumed with finding and killing his brother, Nasus, who he blames, in his madness, for the centuries he spent in darkness.",
        "splash_art": "https://raw.githubusercontent.com/VietHung0712/AssetsLOL/refs/heads/main/Splash_Art/R/Renekton/Renekton_0.jpg",
        "animated_splash_art": null,
        "position_x": 66,
        "position_y": 1,
        "release_date": "2011-07-27",
        "updated_date": null
    },
    {
        "id": "Rengar",
        "name": "Rengar",
        "region": "Ixtal",
        "role": "Assassin",
        "title": "the Pridestalker",
        "voice": "Prey on the weak and you may survive. Prey on the strong and you will truly live.",
        "story": "Rengar is a ferocious vastayan trophy hunter who lives for the thrill of tracking down and killing dangerous creatures. He scours the world for the most fearsome beasts he can find, especially seeking any trace of Kha’Zix, the void creature who scratched out his eye. Rengar stalks his prey neither for food nor glory, but for the sheer beauty of the pursuit.",
        "splash_art": "https://raw.githubusercontent.com/VietHung0712/AssetsLOL/refs/heads/main/Splash_Art/R/Rengar/Rengar_0.jpg",
        "animated_splash_art": "https://cmsassets.rgpub.io/sanity/files/dsfx7636/universe/1d6b5b19b0a0c99fae110db5a04aa46ff3b29baf.webm",
        "position_x": 74,
        "position_y": 20,
        "release_date": "2012-02-01",
        "updated_date": null
    },
    {
        "id": "Riven",
        "name": "Riven",
        "region": "Noxus",
        "role": "Fighter",
        "title": "the Exile",
        "voice": "A warrior’s blade reflects the truth in their heart. Mine is black, and broken.",
        "story": "Once a swordmaster in the warhosts of Noxus, Riven rose through the ranks on the strength of her conviction and brutal efficiency, and was rewarded with a legendary runic blade and a warband of her own. However, on the Ionian front, Riven’s faith in her nation was tested and ultimately broken. She severed all ties to the empire, seeking to find her place in a shattered world, even as rumors abounded that Noxus had been reforged. Now forced to return in chains, she faces the judgment of her former homeland...",
        "splash_art": "https://raw.githubusercontent.com/VietHung0712/AssetsLOL/refs/heads/main/Splash_Art/R/Riven/Riven_0.jpg",
        "animated_splash_art": "",
        "position_x": 86,
        "position_y": 0,
        "release_date": "2010-10-07",
        "updated_date": null
    },
    {
        "id": "Rumble",
        "name": "Rumble",
        "region": "Bandle_City",
        "role": "Fighter",
        "title": "the Mechanized Menace",
        "voice": "Ugh, it's gonna take forever to scrape your face off my suit!",
        "story": "Rumble is a young inventor with a temper. Using nothing more than his own two hands and a heap of scrap, the feisty yordle constructed a colossal mech suit outfitted with an arsenal of electrified harpoons and incendiary rockets. Though others may scoff and sneer at his junkyard creations, Rumble doesn't mind—after all, he's the one with the flamespitter.",
        "splash_art": "https://raw.githubusercontent.com/VietHung0712/AssetsLOL/refs/heads/main/Splash_Art/R/Rumble/Rumble_0.jpg",
        "animated_splash_art": "",
        "position_x": 70,
        "position_y": 1,
        "release_date": "2011-01-18",
        "updated_date": null
    },
    {
        "id": "Ryze",
        "name": "Ryze",
        "region": "Runeterra",
        "role": "Mage",
        "title": "the Rune Mage",
        "voice": "Take care with this world. What is made can be unmade.",
        "story": "Widely considered one of the most adept sorcerers on Runeterra, Ryze is an ancient, hard-bitten archmage with an impossibly heavy burden to bear. Armed with immense arcane power and a boundless constitution, he tirelessly hunts for World Runes—fragments of the raw magic that once shaped the world from nothingness. He must retrieve these artifacts before they fall into the wrong hands, for Ryze understands the horrors they could unleash on Runeterra.",
        "splash_art": "https://raw.githubusercontent.com/VietHung0712/AssetsLOL/refs/heads/main/Splash_Art/R/Ryze/Ryze_0.jpg",
        "animated_splash_art": "https://cmsassets.rgpub.io/sanity/files/dsfx7636/universe/89a2df2d61fe7a417e3b7841d2cefc40e46d8773.webm",
        "position_x": 84,
        "position_y": 35,
        "release_date": "2012-11-21",
        "updated_date": null
    },
    {
        "id": "Samira",
        "name": "Samira",
        "region": "Noxus",
        "role": "Marksman",
        "title": "the Desert Rose",
        "voice": "Virtues, I've got a few. Vices, a few more.",
        "story": " Samira stares death in the eye with unyielding confidence, seeking thrill wherever she goes. After her Shuriman home was destroyed as a child, Samira found her true calling in Noxus, where she built a reputation as a stylish daredevil taking on dangerous missions of the highest caliber. Wielding black-powder pistols and a custom-engineered blade, Samira thrives in life-or-death circumstances, eliminating any who stand in her way with flash and flair.",
        "splash_art": "https://raw.githubusercontent.com/VietHung0712/AssetsLOL/refs/heads/main/Splash_Art/S/Samira/Samira_0.jpg",
        "animated_splash_art": "",
        "position_x": 59,
        "position_y": 2,
        "release_date": "2020-08-27",
        "updated_date": null
    },
    {
        "id": "Sejuani",
        "name": "Sejuani",
        "region": "The_Freljord",
        "role": "Tank",
        "title": "the Winter's Wrath",
        "voice": "I was cut from the ice. Shaped by the storms. Hardened in the cold.",
        "story": "Sejuani is the brutal, unforgiving Warmother of the Winter’s Claw, one of the most feared tribes of the Freljord. Her people’s survival is a constant, desperate battle against the elements, forcing them to raid Noxians, Demacians, and Avarosans alike to survive the harsh winters. Sejuani herself spearheads the most dangerous of these attacks from the saddle of her drüvask boar Bristle, using her True Ice flail to freeze and shatter her enemies.",
        "splash_art": "https://raw.githubusercontent.com/VietHung0712/AssetsLOL/refs/heads/main/Splash_Art/S/Sejuani/Sejuani_0.jpg",
        "animated_splash_art": "",
        "position_x": 61,
        "position_y": 0,
        "release_date": "2013-06-18",
        "updated_date": null
    },
    {
        "id": "Senna",
        "name": "Senna",
        "region": "Runeterra",
        "role": "Support",
        "title": "the Redeemer",
        "voice": "As shadows embrace the light, I will embrace them...",
        "story": "Cursed from childhood to be haunted by the supernatural Black Mist, Senna joined a sacred order known as the Sentinels of Light, and fiercely fought back—only to be killed, her soul imprisoned in a lantern by the cruel wraith Thresh. But refusing to lose hope, within the lantern Senna learned to use the Mist, and reemerged to new life, forever changed. Now wielding darkness along with light, Senna seeks to end the Black Mist by turning it against itself—with every blast of her relic weapon, redeeming the souls lost within.",
        "splash_art": "https://raw.githubusercontent.com/VietHung0712/AssetsLOL/refs/heads/main/Splash_Art/S/Senna/Senna_0.jpg",
        "animated_splash_art": "",
        "position_x": 58,
        "position_y": 11,
        "release_date": "2019-10-15",
        "updated_date": null
    },
    {
        "id": "Seraphine",
        "name": "Seraphine",
        "region": "Piltover",
        "role": "Support",
        "title": "the Starry-Eyed Songstress",
        "voice": "This one’s for you!",
        "story": "Born in Piltover to Zaunite parents, Seraphine can hear the souls of others—the world sings to her, and she sings back. Though these sounds overwhelmed her in her youth, she now draws on them for inspiration, turning the chaos into a symphony. She performs for the sister cities to remind their citizens that they’re not alone, that they’re stronger together, and that, in her eyes, their potential is limitless.",
        "splash_art": "https://raw.githubusercontent.com/VietHung0712/AssetsLOL/refs/heads/main/Splash_Art/S/Seraphine/Seraphine_0.jpg",
        "animated_splash_art": "",
        "position_x": 42,
        "position_y": 19,
        "release_date": "2020-10-29",
        "updated_date": null
    },
    {
        "id": "Sett",
        "name": "Sett",
        "region": "Ionia",
        "role": "Fighter",
        "title": "the Boss",
        "voice": "The boss is here. Hold your applause... seriously, be quiet.",
        "story": " Aleader of Ionia’s growing criminal underworld, Sett rose to prominence in the wake of the war with Noxus. Though he began as a humble challenger in the fighting pits of Navori, he quickly gained notoriety for his savage strength, and his ability to take seemingly endless amounts of punishment. Now, having climbed through the ranks of local combatants, Sett has muscled to the top, reigning over the pits he once fought in.",
        "splash_art": "https://raw.githubusercontent.com/VietHung0712/AssetsLOL/refs/heads/main/Splash_Art/S/Sett/Sett_0.jpg",
        "animated_splash_art": "",
        "position_x": 49,
        "position_y": 9,
        "release_date": "2020-01-14",
        "updated_date": null
    },
    {
        "id": "Shaco",
        "name": "Shaco",
        "region": "Runeterra",
        "role": "Assassin",
        "title": "the Demon Jester",
        "voice": "Whatever you do, don't tell him you missed the punch line.",
        "story": "Crafted long ago as a plaything for a lonely prince, the enchanted marionette Shaco now delights in murder and mayhem. Corrupted by dark magic and the loss of his beloved charge, the once-kind puppet finds pleasure only in the misery of the poor souls he torments. He uses toys and simple tricks to deadly effect, finding the results of his bloody “games” hilarious—and for those who hear a dark chuckle in the dead of night, the Demon Jester may have marked them as his next plaything.",
        "splash_art": "https://raw.githubusercontent.com/VietHung0712/AssetsLOL/refs/heads/main/Splash_Art/S/Shaco/Shaco_0.jpg",
        "animated_splash_art": "",
        "position_x": 75,
        "position_y": 1,
        "release_date": "2014-03-19",
        "updated_date": null
    },
    {
        "id": "Shen",
        "name": "Shen",
        "region": "Ionia",
        "role": "Tank",
        "title": "the Eye of Twilight",
        "voice": "The Eye is blind to fear, to hate, to love – to all things that would sway equilibrium.",
        "story": "Among the secretive, Ionian warriors known as the Kinkou, Shen serves as their leader, the Eye of Twilight. He longs to remain free from the confusion of emotion, prejudice, and ego, and walks the unseen path of dispassionate judgment between the spirit realm and the physical world. Tasked with enforcing the equilibrium between them, Shen wields blades of steel and arcane energy against any who would threaten it.",
        "splash_art": "https://raw.githubusercontent.com/VietHung0712/AssetsLOL/refs/heads/main/Splash_Art/S/Shen/Shen_0.jpg",
        "animated_splash_art": null,
        "position_x": 85,
        "position_y": 0,
        "release_date": "2010-08-01",
        "updated_date": null
    },
    {
        "id": "Shyvana",
        "name": "Shyvana",
        "region": "Demacia",
        "role": "Fighter",
        "title": "the Half-Dragon",
        "voice": "I am of two worlds, yet I belong to neither.",
        "story": " Shyvana is a creature with pure elemental magic blazing in her heart. Though she most often appears humanoid, she can take her true form when necessary—that of a fearsome dragon, incinerating her foes with fiery breath. Having saved the life of the crown prince Jarvan IV, Shyvana now serves uneasily in his royal guard, struggling to find acceptance among the suspicious people of Demacia.",
        "splash_art": "https://raw.githubusercontent.com/VietHung0712/AssetsLOL/refs/heads/main/Splash_Art/S/Shyvana/Shyvana_0.jpg",
        "animated_splash_art": "",
        "position_x": 78,
        "position_y": 0,
        "release_date": "2011-11-01",
        "updated_date": null
    },
    {
        "id": "Singed",
        "name": "Singed",
        "region": "Zaun",
        "role": "Tank",
        "title": "the Mad Chemist",
        "voice": "You mustn’t die yet; I have far too much to learn from your fragile anatomy.",
        "story": "Singed is a brilliant alchemist of dubious morality, whose experiments would turn the stomach of even the most cutthroat criminal. Selling his skills to the highest bidder, he cares little for how his noxious concoctions are used, with the ensuing chaos an experiment in itself. His most infamous work is “shimmer”, which enabled the chembarons to turn Zaun into their personal playground—but fueled by madness, Singed is always working on something new, with each endeavor more depraved than the last...",
        "splash_art": "https://raw.githubusercontent.com/VietHung0712/AssetsLOL/refs/heads/main/Splash_Art/S/Singed/Singed_0.jpg",
        "animated_splash_art": null,
        "position_x": 78,
        "position_y": 1,
        "release_date": "2009-04-18",
        "updated_date": null
    },
    {
        "id": "Sion",
        "name": "Sion",
        "region": "Noxus",
        "role": "Tank",
        "title": "The Undead Juggernaut",
        "voice": "War is eternal... as am I.",
        "story": "A war hero from a bygone era, Sion was revered in Noxus for choking the life out of a Demacian king with his bare hands—but, denied oblivion, he was resurrected to serve his empire even in death. His indiscriminate slaughter claimed all who stood in his way, regardless of allegiance, proving he no longer retained his former humanity. Even so, with crude armor bolted onto rotten flesh, Sion continues to charge into battle with reckless abandon, struggling to remember his true self between the swings of his mighty axe.",
        "splash_art": "https://raw.githubusercontent.com/VietHung0712/AssetsLOL/refs/heads/main/Splash_Art/S/Sion/Sion_0.jpg",
        "animated_splash_art": null,
        "position_x": 78,
        "position_y": 1,
        "release_date": "2016-11-21",
        "updated_date": null
    },
    {
        "id": "Sivir",
        "name": "Sivir",
        "region": "Shurima",
        "role": "Marksman",
        "title": "the Battle Mistress",
        "voice": "Coin may buy you skill for a day, but never loyalty.",
        "story": "Sivir is a renowned mercenary captain who plies her trade in the deserts of Shurima. Armed with her legendary jeweled crossblade, she has fought and won countless battles for those who can afford her services, and prides herself on recovering lost treasures from the catacombs beneath the old empire—for a generous share of the profits, of course. With ancient forces stirring the very bones of Shurima, Sivir now finds herself torn between conflicting destinies…",
        "splash_art": "https://raw.githubusercontent.com/VietHung0712/AssetsLOL/refs/heads/main/Splash_Art/S/Sivir/Sivir_0.jpg",
        "animated_splash_art": "",
        "position_x": 61,
        "position_y": 15,
        "release_date": "2015-06-03",
        "updated_date": null
    },
    {
        "id": "Skarner",
        "name": "Skarner",
        "region": "Ixtal",
        "role": "Tank",
        "title": "the Primordial Sovereign",
        "voice": "I may have faded into legend—but I am no mere story.",
        "story": "The ancient, colossal brackern Skarner is revered in Ixtal as one of the founding members of its ruling caste, the Yun Tal. Devoted to keeping his nation safe from the rest of the world, Skarner dwells in a chamber beneath Ixaocan where he can hear the vibrations of the earth and detect potential threats. As more members of the Yun Tal begin questioning Ixtal's self-isolation, Skarner grows increasingly paranoid and will do anything to keep Ixtal and its people safe—no matter the cost.",
        "splash_art": "https://raw.githubusercontent.com/VietHung0712/AssetsLOL/refs/heads/main/Splash_Art/S/Skarner/Skarner_0.jpg",
        "animated_splash_art": null,
        "position_x": 49,
        "position_y": 84,
        "release_date": "2012-07-11",
        "updated_date": "2024-04-03"
    },
    {
        "id": "Smolder",
        "name": "Smolder",
        "region": "Runeterra",
        "role": "Marksman",
        "title": "the Fiery Fledgling",
        "voice": "Imperial dragons are the best dragons. My mom says so.",
        "story": "Hidden amongst the craggy cliffs of the Noxian frontier, under the watchful eyes of his mother, a young dragon is learning what it means to be heir to the Camavoran imperial dragon lineage. Playful and eager to grow up, Smolder looks for any excuse to practice his burgeoning abilities. Though he's still a fledgling, his skills are nothing to sneeze at, easily setting fire to anything that burns.",
        "splash_art": "https://raw.githubusercontent.com/VietHung0712/AssetsLOL/refs/heads/main/Splash_Art/S/Smolder/Smolder_0.jpg",
        "animated_splash_art": "",
        "position_x": 44,
        "position_y": 30,
        "release_date": "2024-03-20",
        "updated_date": null
    },
    {
        "id": "Sona",
        "name": "Sona",
        "region": "Demacia",
        "role": "Support",
        "title": "Maven of the Strings",
        "voice": "What masterpiece shall we play today?",
        "story": "Sona is a virtuoso of the stringed etwahl, speaking only through her graceful chords and vibrant arias. Her genteel manner has endeared her to the Demacian nobility, though some speculate her arresting melodies actually emanate magic—a dangerous prospect in the kingdom. Silent to outsiders but understood easily enough by close companions, Sona plucks her harmonies not only to soothe injured allies, but also to strike down unsuspecting enemies.",
        "splash_art": "https://raw.githubusercontent.com/VietHung0712/AssetsLOL/refs/heads/main/Splash_Art/S/Sona/Sona_0.jpg",
        "animated_splash_art": "",
        "position_x": 77,
        "position_y": 0,
        "release_date": "2010-09-21",
        "updated_date": null
    },
    {
        "id": "Soraka",
        "name": "Soraka",
        "region": "Targon",
        "role": "Support",
        "title": "the Starchild",
        "voice": "Two paths lie before you, but you can only take one.",
        "story": " Awanderer from the celestial realm, Soraka gave up her immortal form to protect the mortal races from their own ignorance and violent instincts. She endeavors to spread the virtues of compassion and mercy to everyone she meets—guiding the lost, and healing the wounded. For all Soraka has seen of this world's struggles, she still believes the people of Runeterra have yet to reach their full potential.",
        "splash_art": "https://raw.githubusercontent.com/VietHung0712/AssetsLOL/refs/heads/main/Splash_Art/S/Soraka/Soraka_0.jpg",
        "animated_splash_art": "",
        "position_x": 57,
        "position_y": 0,
        "release_date": "2009-02-21",
        "updated_date": null
    },
    {
        "id": "Swain",
        "name": "Swain",
        "region": "Noxus",
        "role": "Mage",
        "title": "the Noxian Grand General",
        "voice": "I have learned enough to detest all men. Only nations may be revered.",
        "story": "Jericho Swain is the visionary ruler of Noxus, an expansionist nation that reveres only strength. Though he was cast down and crippled in the Ionian wars, his left arm severed, he seized control of the empire with ruthless determination… and a new, demonic hand. Now, Swain commands from the front lines, marching against a coming darkness that only he can see—in glimpses gathered by shadowy ravens from the corpses all around him. In a swirl of sacrifice and secrets, the greatest secret of all is that the true enemy lies within.",
        "splash_art": "https://raw.githubusercontent.com/VietHung0712/AssetsLOL/refs/heads/main/Splash_Art/S/Swain/Swain_0.jpg",
        "animated_splash_art": "",
        "position_x": 70,
        "position_y": 0,
        "release_date": "2010-10-19",
        "updated_date": null
    },
    {
        "id": "Sylas",
        "name": "Sylas",
        "region": "Demacia",
        "role": "Mage",
        "title": "the Unshackled",
        "voice": "I am no traitor. I am the true Demacia.",
        "story": "Raised in one of Demacia’s lesser quarters, Sylas of Dregbourne has come to symbolize the darker side of the Great City. As a boy, his ability to root out hidden sorcery caught the attention of the notorious mageseekers, who eventually imprisoned him for turning those same powers against them. Having now broken free, Sylas lives as a hardened revolutionary, using the magic of those around him to destroy the kingdom he once served… and his band of outcast mage followers seems to grow by the day.",
        "splash_art": "https://raw.githubusercontent.com/VietHung0712/AssetsLOL/refs/heads/main/Splash_Art/S/Sylas/Sylas_0.jpg",
        "animated_splash_art": null,
        "position_x": 51,
        "position_y": 10,
        "release_date": "2019-01-24",
        "updated_date": null
    },
    {
        "id": "Syndra",
        "name": "Syndra",
        "region": "Ionia",
        "role": "Mage",
        "title": "the Dark Sovereign",
        "voice": "My potential is limitless. I will not be restrained.",
        "story": " Syndra is a fearsome Ionian mage with incredible power at her command. As a child, she disturbed the village elders with her reckless and wild magic. She was sent away to be taught greater control, but eventually discovered her supposed mentor was restraining her abilities. Forming her feelings of betrayal and hurt into dark spheres of energy, Syndra has sworn to destroy all who would try to control her.",
        "splash_art": "https://raw.githubusercontent.com/VietHung0712/AssetsLOL/refs/heads/main/Splash_Art/S/Syndra/Syndra_0.jpg",
        "animated_splash_art": "",
        "position_x": 50,
        "position_y": 10,
        "release_date": "2012-09-13",
        "updated_date": null
    },
    {
        "id": "TahmKench",
        "name": "Tahm Kench",
        "region": "Runeterra",
        "role": "Tank",
        "title": "the River King",
        "voice": "The whole world's a river, and I'm its king.",
        "story": " Known by many names throughout history, the demon Tahm Kench travels the waterways of Runeterra, feeding his insatiable appetite with the misery of others. Though he may appear singularly charming and proud, he swaggers through the physical realm like a vagabond in search of unsuspecting prey. His lashing tongue can stun even a heavily armored warrior from a dozen paces, and to fall into his rumbling belly is to tumble into an abyss from which there is little hope of return.",
        "splash_art": "https://raw.githubusercontent.com/VietHung0712/AssetsLOL/refs/heads/main/Splash_Art/T/TahmKench/TahmKench_0.jpg",
        "animated_splash_art": "https://cmsassets.rgpub.io/sanity/files/dsfx7636/universe/880b15d0864666f1e5876c445b0001ec5e46cc89.webm",
        "position_x": 84,
        "position_y": 47,
        "release_date": "2015-07-22",
        "updated_date": null
    },
    {
        "id": "Taliyah",
        "name": "Taliyah",
        "region": "Shurima",
        "role": "Mage",
        "title": "the Stoneweaver",
        "voice": "This world is a tapestry of our own making.",
        "story": "Taliyah is a nomadic mage from Shurima, torn between teenage wonder and adult responsibility. She has crossed nearly all of Valoran on a journey to learn the true nature of her growing powers, though more recently she has returned to protect her tribe. Some have mistaken her compassion for weakness and paid the ultimate price—for beneath Taliyah’s youthful demeanor is a will strong enough to move mountains, and a spirit fierce enough to make the earth itself tremble.",
        "splash_art": "https://raw.githubusercontent.com/VietHung0712/AssetsLOL/refs/heads/main/Splash_Art/T/Taliyah/Taliyah_0.jpg",
        "animated_splash_art": "https://cmsassets.rgpub.io/sanity/files/dsfx7636/universe/05cbd428b79d72c57fbbffe976461eb66e23af40.webm",
        "position_x": 87,
        "position_y": 0,
        "release_date": "2016-05-18",
        "updated_date": null
    },
    {
        "id": "Talon",
        "name": "Talon",
        "region": "Noxus",
        "role": "Assassin",
        "title": "the Blade's Shadow",
        "voice": "The three deadliest blademasters in all of Valoran are bound to the house of Du Couteau: my father, myself, and Talon. Challenge us, if you dare.",
        "story": "Talon is the knife in the darkness, a merciless killer able to strike without warning and escape before any alarm is raised. He carved out a dangerous reputation on the brutal streets of Noxus, where he was forced to fight, kill, and steal to survive. Adopted by the notorious Du Couteau family, he now plies his deadly trade at the empire's command, assassinating enemy leaders, captains, and heroes… as well as any Noxian foolish enough to earn the scorn of their masters.",
        "splash_art": "https://raw.githubusercontent.com/VietHung0712/AssetsLOL/refs/heads/main/Splash_Art/T/Talon/Talon_0.jpg",
        "animated_splash_art": null,
        "position_x": 73,
        "position_y": 17,
        "release_date": "2011-08-24",
        "updated_date": null
    },
    {
        "id": "Taric",
        "name": "Taric",
        "region": "Targon",
        "role": "Support",
        "title": "the Shield of Valoran",
        "voice": "The best weapons are beautiful.",
        "story": "Taric is the Aspect of the Protector, wielding incredible power as Runeterra's guardian of life, love, and beauty. Shamed by a dereliction of duty and exiled from his homeland Demacia, Taric ascended Mount Targon to find redemption, only to discover a higher calling among the stars. Imbued with the might of ancient Targon, the Shield of Valoran now stands ever vigilant against the insidious corruption of the Void.",
        "splash_art": "https://raw.githubusercontent.com/VietHung0712/AssetsLOL/refs/heads/main/Splash_Art/T/Taric/Taric_0.jpg",
        "animated_splash_art": "https://cmsassets.rgpub.io/sanity/files/dsfx7636/universe/1037e8b68c585017cfd79b8b96198010097f36a5.webm",
        "position_x": 87,
        "position_y": 6,
        "release_date": "2009-02-21",
        "updated_date": null
    },
    {
        "id": "Teemo",
        "name": "Teemo",
        "region": "Bandle_City",
        "role": "Mage",
        "title": "the Swift Scout",
        "voice": "Bandle Scout Teemo, reporting for duty!",
        "story": "Undeterred by even the most dangerous and threatening of obstacles, Teemo scouts the world with boundless enthusiasm and a cheerful spirit. A yordle with an unwavering sense of morality, he takes pride in following the Bandle Scout's Code, sometimes with such eagerness that he is unaware of the broader consequences of his actions. Though some say the existence of the Scouts is questionable, one thing is for certain: Teemo's conviction is nothing to be trifled with.",
        "splash_art": "https://raw.githubusercontent.com/VietHung0712/AssetsLOL/refs/heads/main/Splash_Art/T/Teemo/Teemo_0.jpg",
        "animated_splash_art": null,
        "position_x": 56,
        "position_y": 13,
        "release_date": "2009-02-21",
        "updated_date": "2024-10-09"
    },
    {
        "id": "Thresh",
        "name": "Thresh",
        "region": "Shadow_Isles",
        "role": "Support",
        "title": "the Chain Warden",
        "voice": "The mind is a wondrous thing to tear apart.",
        "story": "Sadistic and cunning, Thresh is an ambitious and restless spirit of the Shadow Isles. Once the custodian of countless arcane secrets, he was undone by a power greater than life or death, and now sustains himself by tormenting and breaking others with slow, excruciating inventiveness. His victims suffer far beyond their brief mortal coil as Thresh wreaks agony upon their souls, imprisoning them in his unholy lantern to torture for all eternity.",
        "splash_art": "https://raw.githubusercontent.com/VietHung0712/AssetsLOL/refs/heads/main/Splash_Art/T/Thresh/Thresh_0.jpg",
        "animated_splash_art": "https://cmsassets.rgpub.io/sanity/files/dsfx7636/universe_live/7f9303b9a6190c4981e858203470010d9744d3fe.webm",
        "position_x": 69,
        "position_y": 0,
        "release_date": "2013-01-23",
        "updated_date": null
    },
    {
        "id": "Tristana",
        "name": "Tristana",
        "region": "Bandle_City",
        "role": "Marksman",
        "title": "the Yordle Gunner",
        "voice": "Boomer says hi.",
        "story": "While many other yordles channel their energy into discovery, invention, or just plain mischief-making, Tristana was always inspired by the adventures of great warriors. She had heard much about Runeterra, its factions, and its wars, and believed her kind could become worthy of legend too. Setting foot in the world for the first time, she took up her trusty cannon Boomer, and now leaps into battle with steadfast courage and optimism.",
        "splash_art": "https://raw.githubusercontent.com/VietHung0712/AssetsLOL/refs/heads/main/Splash_Art/T/Tristana/Tristana_0.jpg",
        "animated_splash_art": "",
        "position_x": 67,
        "position_y": 4,
        "release_date": "2011-03-01",
        "updated_date": null
    },
    {
        "id": "Trundle",
        "name": "Trundle",
        "region": "The_Freljord",
        "role": "Fighter",
        "title": "the Troll King",
        "voice": "Outsmart anyone you can't beat, and beat anyone you can't outsmart.",
        "story": "Trundle is a hulking and devious troll with a particularly vicious streak, and there is nothing he cannot bludgeon into submission—not even the Freljord itself. Fiercely territorial, he chases down anyone foolish enough to enter his domain. Then, his massive club of True Ice at the ready, he chills his enemies to the bone and impales them with jagged, frozen pillars, laughing as they bleed out onto the tundra.",
        "splash_art": "https://raw.githubusercontent.com/VietHung0712/AssetsLOL/refs/heads/main/Splash_Art/T/Trundle/Trundle_0.jpg",
        "animated_splash_art": "",
        "position_x": 56,
        "position_y": 7,
        "release_date": "2010-11-30",
        "updated_date": null
    },
    {
        "id": "Tryndamere",
        "name": "Tryndamere",
        "region": "The_Freljord",
        "role": "Fighter",
        "title": "the Barbarian King",
        "voice": "Rage is my weapon.",
        "story": "Fueled by unbridled fury and rage, Tryndamere once carved his way through the Freljord, openly challenging the greatest warriors of the north to prepare himself for even darker days ahead. The wrathful barbarian has long sought revenge for the annihilation of his clan, though more recently he has found companionship with Ashe, the Avarosan warmother, and a home with her people. His almost inhuman strength and fortitude is legendary, and has delivered him and his new allies countless victories against the greatest of odds.",
        "splash_art": "https://raw.githubusercontent.com/VietHung0712/AssetsLOL/refs/heads/main/Splash_Art/T/Tryndamere/Tryndamere_0.jpg",
        "animated_splash_art": null,
        "position_x": 77,
        "position_y": 0,
        "release_date": "2012-05-01",
        "updated_date": null
    },
    {
        "id": "TwistedFate",
        "name": "Twisted Fate",
        "region": "Bilgewater",
        "role": "Mage",
        "title": "the Card Master",
        "voice": "It's not gambling if you can't lose...",
        "story": "Twisted Fate is an infamous cardsharp and swindler who has gambled and charmed his way across much of the known world, earning the enmity and admiration of the rich and foolish alike. He rarely takes things seriously, greeting each day with a mocking smile and an insouciant swagger. In every possible way, Twisted Fate always has an ace up his sleeve.",
        "splash_art": "https://raw.githubusercontent.com/VietHung0712/AssetsLOL/refs/heads/main/Splash_Art/T/TwistedFate/TwistedFate_0.jpg",
        "animated_splash_art": null,
        "position_x": 83,
        "position_y": 5,
        "release_date": "2009-02-21",
        "updated_date": null
    },
    {
        "id": "Twitch",
        "name": "Twitch",
        "region": "Zaun",
        "role": "Marksman",
        "title": "the Plague Rat",
        "voice": "They threw this away? But it’s so shiny!",
        "story": "A Zaunite plague rat by birth, but a connoisseur of filth by passion, Twitch is not afraid to get his paws dirty. Aiming a chem-powered crossbow at the gilded heart of Piltover, he has vowed to show those in the city above just how filthy they really are. Always a sneaky sneak, when he's not rooting around in the Sump, he's digging deep into other people's garbage for discarded treasures… and perhaps a moldy sandwich.",
        "splash_art": "https://raw.githubusercontent.com/VietHung0712/AssetsLOL/refs/heads/main/Splash_Art/T/Twitch/Twitch_0.jpg",
        "animated_splash_art": null,
        "position_x": 63,
        "position_y": 27,
        "release_date": "2009-05-01",
        "updated_date": null
    },
    {
        "id": "Udyr",
        "name": "Udyr",
        "region": "The_Freljord",
        "role": "Fighter",
        "title": "the Spirit Walker",
        "voice": "the Spirit Walker",
        "story": "The most powerful spirit walker alive, Udyr communes with all the spirits of the Freljord, whether by empathically understanding their needs, or by channeling and transforming their ethereal energy into his own primal fighting style. He seeks balance within, so that his mind does not get lost amidst others, but he also seeks balance without—for the Freljord's mystical landscape can only thrive with the growth that comes from conflict and struggle, and Udyr knows that sacrifices must be made to keep peaceful stagnance at bay.",
        "splash_art": "https://raw.githubusercontent.com/VietHung0712/AssetsLOL/refs/heads/main/Splash_Art/U/Udyr/Udyr_0.jpg",
        "animated_splash_art": "",
        "position_x": 53,
        "position_y": 0,
        "release_date": "2009-12-02",
        "updated_date": null
    },
    {
        "id": "Urgot",
        "name": "Urgot",
        "region": "Zaun",
        "role": "Fighter",
        "title": "the Dreadnought",
        "voice": "There is only one way to measure a man. Tear him… into… pieces.",
        "story": "Once a powerful Noxian headsman, Urgot was betrayed by the empire for which he had killed so many. Bound in iron chains, he was forced to learn the true meaning of strength in the Dredge—a prison mine deep beneath Zaun. Emerging in a disaster that spread chaos throughout the city, he now casts an imposing shadow over its criminal underworld. Raising his victims on the very chains that once enslaved him, he will purge his new home of the unworthy, making it a crucible of pain.",
        "splash_art": "https://raw.githubusercontent.com/VietHung0712/AssetsLOL/refs/heads/main/Splash_Art/U//Urgot/Urgot_0.jpg",
        "animated_splash_art": null,
        "position_x": 56,
        "position_y": 6,
        "release_date": "2010-03-10",
        "updated_date": null
    },
    {
        "id": "Varus",
        "name": "Varus",
        "region": "Ionia",
        "role": "Marksman",
        "title": "the Arrow of Retribution",
        "voice": "You didn’t destroy us all. And that mistake will be your undoing.",
        "story": "One of the ancient darkin, Varus was a deadly killer who loved to torment his foes, driving them almost to insanity before delivering the killing arrow. He was imprisoned at the end of the Great Darkin War, but escaped centuries later in the remade flesh of two Ionian hunters—they had unwittingly released him, cursed to bear the bow containing his bound essence. Varus now seeks out those who trapped him, in order to enact his brutal vengeance, but the mortal souls within still resist him every step of the way.",
        "splash_art": "https://raw.githubusercontent.com/VietHung0712/AssetsLOL/refs/heads/main/Splash_Art/V/Varus/Varus_0.jpg",
        "animated_splash_art": null,
        "position_x": 54,
        "position_y": 0,
        "release_date": "2012-06-01",
        "updated_date": null
    },
    {
        "id": "Vayne",
        "name": "Vayne",
        "region": "Demacia",
        "role": "Marksman",
        "title": "the Night Hunter",
        "voice": "I don’t kill creatures like you because it’s the right thing to do. I kill you because I enjoy it.",
        "story": "Shauna Vayne is a deadly, remorseless Demacian monster hunter, who has dedicated her life to finding and destroying the demon that murdered her family. Armed with a wrist-mounted crossbow and a heart full of vengeance, she is only truly happy when slaying practitioners or creations of the dark arts, striking from the shadows with a flurry of silver bolts.",
        "splash_art": "https://raw.githubusercontent.com/VietHung0712/AssetsLOL/refs/heads/main/Splash_Art/V/Vayne/Vayne_0.jpg",
        "animated_splash_art": "",
        "position_x": 92,
        "position_y": 11,
        "release_date": "2011-06-27",
        "updated_date": null
    },
    {
        "id": "Veigar",
        "name": "Veigar",
        "region": "Bandle_City",
        "role": "Mage",
        "title": "the Tiny Master of Evil",
        "voice": "You deny the darkness in your soul...",
        "story": "An enthusiastic master of dark sorcery, Veigar has embraced powers that few mortals dare approach. As a free-spirited inhabitant of Bandle City, he longed to push beyond the limitations of yordle magic, and turned instead to arcane texts that had been hidden away for thousands of years. Now a stubborn creature with an endless fascination for the mysteries of the universe, Veigar is often underestimated by others—but even though he believes himself truly evil, he possesses an inner morality that leads some to question his deeper motivations.",
        "splash_art": "https://raw.githubusercontent.com/VietHung0712/AssetsLOL/refs/heads/main/Splash_Art/V/Veigar/Veigar_0.jpg",
        "animated_splash_art": null,
        "position_x": 71,
        "position_y": 10,
        "release_date": "2009-07-24",
        "updated_date": null
    },
    {
        "id": "VelKoz",
        "name": "Vel'Koz",
        "region": "The_Void",
        "role": "Mage",
        "title": "the Eye of the Void",
        "voice": "Only by deconstruction is truth revealed.",
        "story": "It is unclear if Vel'Koz was the first Void-spawn to emerge on Runeterra, but there has certainly never been another to match his level of cruel, calculating sentience. While his kin devour or defile everything around them, he seeks instead to scrutinize and study the physical realm—and the strange, warlike beings that dwell there—for any weakness the Void might exploit. But Vel'Koz is far from a passive observer, striking back at threats with deadly plasma, or by disrupting the very fabric of the world itself.",
        "splash_art": "https://raw.githubusercontent.com/VietHung0712/AssetsLOL/refs/heads/main/Splash_Art/V/VelKoz/VelKoz_0.jpg",
        "animated_splash_art": "https://cmsassets.rgpub.io/sanity/files/dsfx7636/universe/f4ccf1814f268ba3fe7f19d9926f8413083443fe.webm",
        "position_x": 62,
        "position_y": 32,
        "release_date": "2014-01-22",
        "updated_date": null
    },
    {
        "id": "Vex",
        "name": "Vex",
        "region": "Shadow_Isles",
        "role": "Mage",
        "title": "the Gloomist",
        "voice": "Just... ughhhhh.",
        "story": "In the black heart of the Shadow Isles, a lone yordle trudges through the spectral fog, content in its murky misery. With an endless supply of teen angst and a powerful shadow in tow, Vex lives in her own self-made slice of gloom, far from the revolting cheer of the “normie” world. Though she lacks ambition, she is quick to strike down color and happiness, stopping all would-be interlopers with her magical malaise.",
        "splash_art": "https://raw.githubusercontent.com/VietHung0712/AssetsLOL/refs/heads/main/Splash_Art/V/Vex/Vex_0.jpg",
        "animated_splash_art": null,
        "position_x": 65,
        "position_y": 14,
        "release_date": "2021-10-27",
        "updated_date": null
    },
    {
        "id": "Vi",
        "name": "Vi",
        "region": "Piltover",
        "role": "Fighter",
        "title": "the Piltover Enforcer",
        "voice": "We can either do this the hard way or… Oh wait, no. There's just the hard way.",
        "story": "Raised on the mean streets of Zaun, Vi is a hotheaded, impulsive, and fearsome woman with very little respect for authority. She has always been a shrewd survivor, both from her youthful troublemaking topside and an unfairly long stint in Stillwater Hold. Now working with the Piltover Enforcers to keep the peace instead of breaking it, she wields mighty hextech gauntlets that can punch through walls—and criminals—with equal ease.",
        "splash_art": "https://raw.githubusercontent.com/VietHung0712/AssetsLOL/refs/heads/main/Splash_Art/V/Vi/Vi_0.jpg",
        "animated_splash_art": "https://cmsassets.rgpub.io/sanity/files/dsfx7636/universe/e52b22b97e6f6df98a0cb0b8cbd940a70f2dc47b.webm",
        "position_x": 76,
        "position_y": 19,
        "release_date": "2012-12-19",
        "updated_date": null
    },
    {
        "id": "Viego",
        "name": "Viego",
        "region": "Shadow_Isles",
        "role": "Fighter",
        "title": "the Ruined King",
        "voice": "No price is too great. No atrocity beyond my reach. For her... I will do anything.",
        "story": "Once ruler of a long-lost kingdom, Viego perished over a thousand years ago when his attempt to bring his wife back from the dead triggered the magical catastrophe known as the Ruination. Transformed into a powerful, unliving wraith tortured by an obsessive longing for his centuries-dead queen, Viego now stands as the Ruined King, controlling the deadly Harrowings as he scours Runeterra for anything that might one day restore her, and destroying all in his path as the Black Mist pours endlessly from his cruel, broken heart.",
        "splash_art": "https://raw.githubusercontent.com/VietHung0712/AssetsLOL/refs/heads/main/Splash_Art/V/Viego/Viego_0.jpg",
        "animated_splash_art": "",
        "position_x": 80,
        "position_y": 18,
        "release_date": "2021-01-21",
        "updated_date": null
    },
    {
        "id": "Viktor",
        "name": "Viktor",
        "region": "Zaun",
        "role": "Mage",
        "title": "Herald of the Arcane",
        "voice": "Join the Glorious Evolution.",
        "story": "The fully biomechanical evolution of his former self, Viktor has embraced his Glorious Evolution and become something of a messiah to his followers. He sacrificed his own humanity under the logic that eliminating emotion would thereby eliminate suffering—and now seeks to bring the revelation of the hexcore to the rest of the world, even if they’re incapable of understanding the benefit. After all, to this master of the arcane, violence is merely a variable necessary to balance the ultimate equation.",
        "splash_art": "https://raw.githubusercontent.com/VietHung0712/AssetsLOL/refs/heads/main/Splash_Art/V/Viktor/Viktor_0.jpg",
        "animated_splash_art": null,
        "position_x": 45,
        "position_y": 2,
        "release_date": "2011-12-29",
        "updated_date": "2024-12-11"
    },
    {
        "id": "Vladimir",
        "name": "Vladimir",
        "region": "Noxus",
        "role": "Mage",
        "title": "the Crimson Reaper",
        "voice": "Time has made me wiser, but no more patient.",
        "story": "Afiend with a thirst for mortal blood, Vladimir has influenced the affairs of Noxus since the empire’s earliest days. In addition to unnaturally extending his life, his mastery of hemomancy allows him to control the minds and bodies of others as easily as his own. In the flamboyant salons of the Noxian aristocracy, this enabled him to build a fanatical cult of personality around himself—while in the lowest back alleys, it allows him to bleed his enemies dry.",
        "splash_art": "https://raw.githubusercontent.com/VietHung0712/AssetsLOL/refs/heads/main/Splash_Art/V/Vladimir/Vladimir_0.jpg",
        "animated_splash_art": null,
        "position_x": 84,
        "position_y": 3,
        "release_date": "2011-05-10",
        "updated_date": null
    },
    {
        "id": "Volibear",
        "name": "Volibear",
        "region": "The_Freljord",
        "role": "Fighter",
        "title": "the Relentless Storm",
        "voice": "They have forgotten the old ways. The old ways have not forgotten them.",
        "story": "To those who still revere him, the Volibear is the storm made manifest. Destructive, wild, and stubbornly resolute, he existed before mortals walked the Freljord’s tundra, and is fiercely protective of the lands that he and his demi-god kin created. Cultivating a deep hatred of civilization and the weakness it brought with it, he now fights to return to the old ways—when the land was untamed, and blood spilled freely—and eagerly battles all who oppose him, with tooth, claw, and thundering domination.",
        "splash_art": "https://raw.githubusercontent.com/VietHung0712/AssetsLOL/refs/heads/main/Splash_Art/V/Volibear/Volibear_0.jpg",
        "animated_splash_art": "",
        "position_x": 58,
        "position_y": 4,
        "release_date": "2011-11-29",
        "updated_date": null
    },
    {
        "id": "Warwick",
        "name": "Warwick",
        "region": "Zaun",
        "role": "Fighter",
        "title": "The Uncaged Wrath of Zaun",
        "voice": "Spill blood... draw the beast!",
        "story": "Warwick is a monster who hunts the gray alleys of Zaun. Transformed by agonizing experiments, his body is fused with an intricate system of chambers and pumps, machinery filling his veins with alchemical rage. He bursts from the shadows to prey upon those criminals who terrorize the city's depths. Warwick is drawn to blood, driven mad by its scent… and none who spill it can escape him.",
        "splash_art": "https://raw.githubusercontent.com/VietHung0712/AssetsLOL/refs/heads/main/Splash_Art/W/Warwick/Warwick_0.jpg",
        "animated_splash_art": "https://cmsassets.rgpub.io/sanity/files/dsfx7636/universe/0949a15282f3a238556c54737b9a2feedbd88e2a.webm",
        "position_x": 69,
        "position_y": 61,
        "release_date": "2009-02-21",
        "updated_date": null
    },
    {
        "id": "Wukong",
        "name": "Wukong",
        "region": "Ionia",
        "role": "Fighter",
        "title": "the Monkey King",
        "voice": "My journey is only beginning…",
        "story": "Wukong is a vastayan trickster who uses his strength, agility, and intelligence to confuse his opponents and gain the upper hand. After finding a lifelong friend in the warrior known as Master Yi, Wukong became the last student of the ancient martial art known as Wuju. Armed with an enchanted staff, Wukong seeks to prevent Ionia from falling to ruin.",
        "splash_art": "https://raw.githubusercontent.com/VietHung0712/AssetsLOL/refs/heads/main/Splash_Art/W/Wukong/Wukong_0.jpg",
        "animated_splash_art": null,
        "position_x": 70,
        "position_y": 18,
        "release_date": "2011-07-26",
        "updated_date": null
    },
    {
        "id": "Xayah",
        "name": "Xayah",
        "region": "Ionia",
        "role": "Marksman",
        "title": "the Rebel",
        "voice": "Cause then... I wouldn't get to hear you ask.",
        "story": "Deadly and precise, Xayah is a vastayan revolutionary waging a personal war to save her people. She uses her speed, guile, and razor-sharp feather blades to cut down anyone who stands in her way. Xayah fights alongside her partner and lover, Rakan, to protect their dwindling tribe, and restore their race to her vision of its former glory.",
        "splash_art": "https://raw.githubusercontent.com/VietHung0712/AssetsLOL/refs/heads/main/Splash_Art/R/Rakan_Xayah/Rakan_Xayah_0.jpg",
        "animated_splash_art": "",
        "position_x": 69,
        "position_y": 24,
        "release_date": "2017-09-27",
        "updated_date": null
    },
    {
        "id": "Xerath",
        "name": "Xerath",
        "region": "Shurima",
        "role": "Mage",
        "title": "the Magus Ascendant",
        "voice": "A lifetime as a slave has prepared me for eternity as your master.",
        "story": "Xerath is an Ascended Magus of ancient Shurima, a being of arcane energy writhing in the broken shards of a magical sarcophagus. For millennia, he was trapped beneath the desert sands, but the rise of Shurima freed him from his ancient prison. Driven insane with power, he now seeks to take what he believes is rightfully his and replace the upstart civilizations of the world with one fashioned in his image.",
        "splash_art": "https://raw.githubusercontent.com/VietHung0712/AssetsLOL/refs/heads/main/Splash_Art/X/Xerath/Xerath_0.jpg",
        "animated_splash_art": null,
        "position_x": 58,
        "position_y": 3,
        "release_date": "2017-05-04",
        "updated_date": null
    },
    {
        "id": "XinZhao",
        "name": "Xin Zhao",
        "region": "Demacia",
        "role": "Fighter",
        "title": "the Seneschal of Demacia",
        "voice": "Death is inevitable. One can only avoid defeat.",
        "story": "Xin Zhao is a resolute warrior loyal to the ruling Lightshield dynasty. Once condemned to the fighting pits of Noxus, he survived countless gladiatorial bouts, but after being freed by Demacian forces, he swore his life and allegiance to these brave liberators. Armed with his favored three-talon spear, Xin Zhao now fights for his adopted kingdom, audaciously challenging any foe, no matter the odds.",
        "splash_art": "https://raw.githubusercontent.com/VietHung0712/AssetsLOL/refs/heads/main/Splash_Art/X/XinZhao/XinZhao_0.jpg",
        "animated_splash_art": null,
        "position_x": 53,
        "position_y": 27,
        "release_date": "2010-07-13",
        "updated_date": null
    },
    {
        "id": "Yasuo",
        "name": "Yasuo",
        "region": "Ionia",
        "role": "Fighter",
        "title": "the Unforgiven",
        "voice": "Death is like the wind—always by my side.",
        "story": " An Ionian of deep resolve, Yasuo is an agile swordsman who wields the air itself against his enemies. As a proud young man, he was falsely accused of murdering his master—unable to prove his innocence, he was forced to slay his own brother in self-defense. In time, his master’s true killer was revealed, and his brother mysteriously returned from death, yet Yasuo still could not forgive himself for all he had done. Now, he wanders the world with only the wind to guide his blade.",
        "splash_art": "https://raw.githubusercontent.com/VietHung0712/AssetsLOL/refs/heads/main/Splash_Art/Y/Yasuo/Yasuo_0.jpg",
        "animated_splash_art": "https://cmsassets.rgpub.io/sanity/files/dsfx7636/universe/64bf102eba34a29dfe59d0595f916a0848753141.webm",
        "position_x": 88,
        "position_y": 31,
        "release_date": "2013-12-18",
        "updated_date": null
    },
    {
        "id": "Yone",
        "name": "Yone",
        "region": "Ionia",
        "role": "Fighter",
        "title": "the Unforgotten",
        "voice": "They look at me and see only the mask. I look at them and see only their fears.",
        "story": "In life, he was Yone—half-brother of Yasuo, and renowned student of his village's sword school. But upon his death at the hands of his brother, he found himself hunted by a malevolent entity of the spirit realm, and was forced to slay it with its own sword. Now, cursed to wear its demonic mask upon his face, Yone tirelessly hunts all such creatures in order to understand what he has become.",
        "splash_art": "https://raw.githubusercontent.com/VietHung0712/AssetsLOL/refs/heads/main/Splash_Art/Y/Yone/Yone_0.jpg",
        "animated_splash_art": null,
        "position_x": 59,
        "position_y": 2,
        "release_date": "2020-08-06",
        "updated_date": null
    },
    {
        "id": "Yorick",
        "name": "Yorick",
        "region": "Shadow_Isles",
        "role": "Fighter",
        "title": "Shepherd of Souls",
        "voice": "These isles… How they scream.",
        "story": "The last survivor of a long-forgotten religious order, Yorick is both blessed and cursed with power over the dead. Trapped on the Shadow Isles, his only companions are the rotting corpses and shrieking wraiths that he gathers to him. Yorick's monstrous actions belie his noble purpose: to free his home from the curse of the Ruination.",
        "splash_art": "https://raw.githubusercontent.com/VietHung0712/AssetsLOL/refs/heads/main/Splash_Art/Y/Yorick/Yorick_0.jpg",
        "animated_splash_art": "",
        "position_x": 70,
        "position_y": 2,
        "release_date": "2011-06-22",
        "updated_date": null
    },
    {
        "id": "Yuumi",
        "name": "Yuumi",
        "region": "Bandle_City",
        "role": "Support",
        "title": "the Magical Cat",
        "voice": "Cats are made of twilight and tricks, dogs are made of barks and sticks! Book’s just old trees.",
        "story": "A magical cat from Bandle City, Yuumi was once the familiar of a yordle enchantress, Norra. When her master mysteriously disappeared, Yuumi became the Keeper of Norra's sentient Book of Thresholds, traveling through portals in its pages to search for her. Yearning for affection, Yuumi seeks friendly companions to partner with on her journey, protecting them with luminous shields and fierce resolve. While Book strives to keep her on task, Yuumi is often drawn to worldly comforts, such as naps and fish. In the end, however, she always returns to her quest to find her friend.",
        "splash_art": "https://raw.githubusercontent.com/VietHung0712/AssetsLOL/refs/heads/main/Splash_Art/Y/Yuumi/Yuumi_0.jpg",
        "animated_splash_art": null,
        "position_x": 45,
        "position_y": 6,
        "release_date": "2019-06-12",
        "updated_date": null
    },
    {
        "id": "Zac",
        "name": "Zac",
        "region": "Zaun",
        "role": "Tank",
        "title": "the Secret Weapon",
        "voice": "The angrier you get, the more this is going to hurt...",
        "story": "Zac is the product of a toxic spill that ran through a chemtech seam and pooled in an isolated cavern deep in Zaun's Sump. Despite such humble origins, Zac has grown from primordial ooze into a thinking being who dwells in the city's pipes, occasionally emerging to help those who cannot help themselves or to rebuild the broken infrastructure of Zaun.",
        "splash_art": "https://raw.githubusercontent.com/VietHung0712/AssetsLOL/refs/heads/main/Splash_Art/Z/Zac/Zac_0.jpg",
        "animated_splash_art": "https://cmsassets.rgpub.io/sanity/files/dsfx7636/universe/68372b4aa65c32e9aa6ee9a4198fdd4d15816cc3.webm",
        "position_x": 76,
        "position_y": 60,
        "release_date": "2013-03-29",
        "updated_date": null
    },
    {
        "id": "Zed",
        "name": "Zed",
        "region": "Ionia",
        "role": "Assassin",
        "title": "the Master of Shadows",
        "voice": "The unseen blade is the deadliest.",
        "story": "Utterly ruthless and without mercy, Zed is the leader of the Order of Shadow, an organization he created with the intent of militarizing Ionia’s magical and martial traditions to drive out Noxian invaders. During the war, desperation led him to unlock the secret shadow form—a malevolent spirit magic as dangerous and corrupting as it is powerful. Zed has mastered all of these forbidden techniques to destroy anything he sees as a threat to his nation, or his new order.",
        "splash_art": "https://raw.githubusercontent.com/VietHung0712/AssetsLOL/refs/heads/main/Splash_Art/Z/Zed/Zed_0.jpg",
        "animated_splash_art": "https://cmsassets.rgpub.io/sanity/files/dsfx7636/universe/5cb0965af44636e26e714ab08e77689950689f8c.webm",
        "position_x": 73,
        "position_y": 3,
        "release_date": "2012-10-23",
        "updated_date": null
    },
    {
        "id": "Zeri",
        "name": "Zeri",
        "region": "Zaun",
        "role": "Marksman",
        "title": "the Spark of Zaun",
        "voice": "I belong here. We all belong here.",
        "story": "Aheadstrong, spirited young woman from Zaun’s working-class, Zeri channels her electric magic to charge herself and her custom-crafted gun. Her volatile power mirrors her emotions, its sparks reflecting her lightning-fast approach to life. Deeply compassionate toward others, Zeri carries the love of her family and her home into every fight. Though her eagerness to help can sometimes backfire, Zeri believes one truth to be certain: stand up for your community, and it will stand up with you.",
        "splash_art": "https://raw.githubusercontent.com/VietHung0712/AssetsLOL/refs/heads/main/Splash_Art/Z/Zeri/Zeri_0.jpg",
        "animated_splash_art": "",
        "position_x": 57,
        "position_y": 28,
        "release_date": "2022-01-20",
        "updated_date": null
    },
    {
        "id": "Ziggs",
        "name": "Ziggs",
        "region": "Zaun",
        "role": "Mage",
        "title": "the Hexplosives Expert",
        "voice": "Ziggs? Unpredictable, dangerous, yes yes. But quite brilliant!",
        "story": "With a love of big bombs and short fuses, the yordle Ziggs is an explosive force of nature. As an inventor's assistant in Piltover, he was bored by his predictable life and befriended a mad, blue-haired bomber named Jinx. After a wild night on the town, Ziggs took her advice and moved to Zaun, where he now explores his fascinations more freely, terrorizing the chem-barons and regular citizens alike in his never ending quest to blow stuff up.",
        "splash_art": "https://raw.githubusercontent.com/VietHung0712/AssetsLOL/refs/heads/main/Splash_Art/Z/Ziggs/Ziggs_0.jpg",
        "animated_splash_art": "",
        "position_x": 75,
        "position_y": 33,
        "release_date": "2012-03-26",
        "updated_date": null
    },
    {
        "id": "Zilean",
        "name": "Zilean",
        "region": "Runeterra",
        "role": "Support",
        "title": "the Chronokeeper",
        "voice": "There is no greater grief than for a loss that is yet to come.",
        "story": "Once a powerful Icathian mage, Zilean became obsessed with the passage of time after witnessing his homeland's destruction by the Void. Unable to spare even a minute to grieve the catastrophic loss, he called upon ancient temporal magic to divine all possible outcomes. Having become functionally immortal, Zilean now drifts through the past, present, and future, bending and warping the flow of time around him, always searching for that elusive moment that will turn back the clock and undo Icathia's destruction.",
        "splash_art": "https://raw.githubusercontent.com/VietHung0712/AssetsLOL/refs/heads/main/Splash_Art/Z/Zilean/Zilean_0.jpg",
        "animated_splash_art": null,
        "position_x": 61,
        "position_y": 1,
        "release_date": "2011-03-01",
        "updated_date": null
    },
    {
        "id": "Zoe",
        "name": "Zoe",
        "region": "Targon",
        "role": "Mage",
        "title": "the Aspect of Twilight",
        "voice": "I bring a message for you all—a warning, a sigil. But first, I wanna see the sparkleflies!",
        "story": "As the embodiment of mischief, imagination, and change, Zoe acts as the cosmic messenger of Targon, heralding major events that reshape worlds. Her mere presence warps the arcane mathematics governing realities, sometimes causing cataclysms without conscious effort or malice. This perhaps explains the breezy nonchalance with which Zoe approaches her duties, giving her plenty of time to focus on playing games, tricking mortals, or otherwise amusing herself. An encounter with Zoe can be joyous and life affirming, but it is always more than it appears and often extremely dangerous.",
        "splash_art": "https://raw.githubusercontent.com/VietHung0712/AssetsLOL/refs/heads/main/Splash_Art/Z/Zoe/Zoe_0.jpg",
        "animated_splash_art": "",
        "position_x": 55,
        "position_y": 17,
        "release_date": "2017-12-06",
        "updated_date": null
    },
    {
        "id": "Zyra",
        "name": "Zyra",
        "region": "Ixtal",
        "role": "Mage",
        "title": "Rise of the Thorns",
        "voice": "Where are your friends? Mine are all around…",
        "story": " Born in an ancient, sorcerous catastrophe, Zyra is the wrath of nature given form—an alluring hybrid of plant and human, kindling new life with every step. She views the many mortals of Valoran as little more than prey for her seeded progeny, and thinks nothing of slaying them with flurries of deadly spines. Though her true purpose has not been revealed, Zyra wanders the world, indulging her most primal urges to colonize, and strangle all other life from it.",
        "splash_art": "https://raw.githubusercontent.com/VietHung0712/AssetsLOL/refs/heads/main/Splash_Art/Z/Zyra/Zyra_0.jpg",
        "animated_splash_art": "https://cmsassets.rgpub.io/sanity/files/dsfx7636/universe/374f35f73d16ac029e6f67b3c399f8094d92109b.webm",
        "position_x": 88,
        "position_y": 5,
        "release_date": "2016-03-31",
        "updated_date": null
    }
]